[
    {
        "index": 1,
        "title": "[Hiring] Travel CT Technologist - $2,008 per week",
        "body": "We are seeking a travel CT Technologist for a travel job in Moberly, Missouri. \n\nShift: 12 hours, days\n\nEmployment Type: Travel\n\n# Benefits\n\n* Weekly pay\n* Holiday Pay\n* Guaranteed Hours\n* 401k retirement plan\n* Pet insurance\n* Company provided housing options\n* Sick pay\n* Wellness and fitness programs\n* Referral bonus\n* Medical benefits\n* Dental benefits\n* Vision benefits\n\nRate $2,008 per week\n\n# Location: MO - Moberly\n\n\n\n",
        "author": "Top-Dragonfruit5846",
        "url": "https://www.reddit.com/r/forhire/comments/1etsmf7/hiring_travel_ct_technologist_2008_per_week/",
        "created": "2024-08-16 21:32:34",
        "created_unix": 1723824154.0
    },
    {
        "index": 3,
        "title": "[Hiring] Travel Nurse RN - Med Surg  ",
        "body": "We are seeking a travel nurse RN Med Surg for a travel nursing job in Camden, South Carolina.\n\n Shift: 12 hours, nights\n\n Employment Type: Travel\n\nRate $1,776 per week\n\n# Location: SC - Camden",
        "author": "Top-Dragonfruit5846",
        "url": "https://www.reddit.com/r/forhire/comments/1etsfw6/hiring_travel_nurse_rn_med_surg/",
        "created": "2024-08-16 21:25:40",
        "created_unix": 1723823740.0
    },
    {
        "index": 4,
        "title": "[Hiring] CDL A Local Delivery Truck Driver",
        "body": "We has immediate job openings for dependable local CDL A Delivery Truck Driver to safely and efficiently operate a tractor-trailer and manually unload/deliver various products (meats, produce, frozen foods, groceries, dry goods, supplies, etc.) to customer locations on an assigned route schedule. Our truck drivers build relationships with each customer using their positive, friendly attitude and become familiar with their operations to meet needs and expectations.\n\n~Rate 40/h~  \n~Minimum Requirements~\n\n* Must submit to a pre-employment background check and drug screen.\n* License to drive - valid Class A Commercial Driver License (CDL) with a clean driving record.\n\n# Location  SC - CHARLESTON",
        "author": "Top-Dragonfruit5846",
        "url": "https://www.reddit.com/r/forhire/comments/1etsdfu/hiring_cdl_a_local_delivery_truck_driver/",
        "created": "2024-08-16 21:22:59",
        "created_unix": 1723823579.0
    },
    {
        "index": 6,
        "title": "[Hiring] Shift Lead",
        "body": "We are looking Shift Lead on full time postion. The purpose of the Shift Leader is to make the lives of the employees and the guests better by creating opportunities to positively impact life experiences. You are responsible for the operation of the entire restaurant and building a strong team that consistently provides customers great food and a friendly experience. Rate 35/h\n\n**Required or Preferred Experience:**\n\n* High school diploma or equivalent.\n\nLocation:Rochester, MN-55903",
        "author": "Top-Dragonfruit5846",
        "url": "https://www.reddit.com/r/forhire/comments/1ets47w/hiring_shift_lead/",
        "created": "2024-08-16 21:12:34",
        "created_unix": 1723822954.0
    },
    {
        "index": 7,
        "title": "[Hiring] Virtual Assistant",
        "body": "Hello, I am looking for a virtual assistant that has experience with the following:\n\nFunnels on social media.\n\nDigital Incentives\n\nCommunity Groups\n\nPlease DM for more information I would be glad to speak to you!",
        "author": "Chemical_Custard766",
        "url": "https://www.reddit.com/r/forhire/comments/1etrfsq/hiring_virtual_assistant/",
        "created": "2024-08-16 20:45:20",
        "created_unix": 1723821320.0
    },
    {
        "index": 12,
        "title": "[Hiring] (Online) Looking for a copywriter and Video Editors with League of Legends and/or Valorant experience ",
        "body": "**Who we are:**\nWe are one of the biggest companies that deliver supplementary services and products for League of Legends and Valorant players. We are looking for a new  Copy/Content writer and Video deditors. If we decide to work together, you will have an opportunity to work in an emerging market of Gaming.\n\n\n**Who we are looking for:**\n* Someone with extensive league of legends knowledge, mainly about skins, champions, and the entire esports ecosystem.\n* Experience in copywriting and/or Video editing writing\n* Available samples\n* Good availability\n* Interested in the gaming niche\n* Good knowledge about League of Legends and/or Valorant\nSalary, Hourly Rate: 15-100+$ per 1000 words for video editors 15$+ per hour of work (or per project basis)\n\n\n**Want to apply?** [**The only way to apply is by filling out a form here**](https://forms.gle/9oZbHpypdL1eP6Bn6)**.** There is no other way to apply all DMs will be ignored. You are not a good copywriter if you can't read out the instructions given to you. We do this to reduce the noise from unqualified people.",
        "author": "lcurva",
        "url": "https://www.reddit.com/r/forhire/comments/1etpp97/hiring_online_looking_for_a_copywriter_and_video/",
        "created": "2024-08-16 19:36:59",
        "created_unix": 1723817219.0
    },
    {
        "index": 13,
        "title": "[Hiring] Experienced video editor for advertisements",
        "body": "Hi, everyone! I'm looking for a highly experienced video editor to turn raw footage into advertisements.\n\nThere are 5 ads in total: three 30 second ads, and two 60 second ads. We will provide the exact editing directions and the footage, and we would need it editing during the week of Aug 26-31.\n\nEditing would include adjusting audio where needed, transitioning clips, adding text overlay and music where needed. The editor must be able to deliver within the deadline and that the videos are kept within the appropriate length. **Important: the ads are not low-effort AI ads with B-roll clips. We have hired actors and have a shoot planned to get all footage. There are live actors and dialogue. Do not apply if you have only worked with B-roll and AI.**\n\nOur maximum budget is $1550 as set by an agency, but I have always preferred working with individuals, as a freelancer myself. If interested, please message me with your fees for this project as well as a portfolio.\n\nWhat we're looking for in this portfolio are:\n\n* ideally, prior work in advertisement\n* smooth transitions between clips\n* videos that tell a story, not just a slideshow of static clips",
        "author": "Kari-kateora",
        "url": "https://www.reddit.com/r/forhire/comments/1etpgi0/hiring_experienced_video_editor_for_advertisements/",
        "created": "2024-08-16 19:26:50",
        "created_unix": 1723816610.0
    },
    {
        "index": 15,
        "title": "[Hiring] Django, react/Vue Developer - $30-40/hr DOE",
        "body": "I run a custom furniture company. I was users to be able to design their furniture in an online wizard. Yes, a somewhat complex wizard. \n\nIf you're interested, please message me with experience related to this task. A link to your project, even better.",
        "author": "just_legalism",
        "url": "https://www.reddit.com/r/forhire/comments/1etoogo/hiring_django_reactvue_developer_3040hr_doe/",
        "created": "2024-08-16 18:52:55",
        "created_unix": 1723814575.0
    },
    {
        "index": 16,
        "title": "[Hiring] Test Center Secret Shop Audits (Across U.S. States) ",
        "body": "We are hiring multiple individuals as auditors to inspect and audit partnering test centers in U.S. States \n\nJob Details: As part of the Secret Shop, you will inspect a testing facility by posing as a candidate scheduled for a test. Your responsibilities will include checking and photographing the facilities at the center and completing specific tasks, such as attempting to bring a cell phone and a piece of paper into the test room as a form of misconduct. This is to assess whether the Test Proctor detects these items during the pre-test check or notices them during the test, and how they respond. After completing the audit, you will need to fill out a report with pictures and details and submit it. Duration: Approximately 2 hours per audit at each center, plus around 30 minutes for report completion. \n\nPayment: $250 to $300 per audit/center, depending on the number of locations you can cover. Payment includes report submission and will be made upon approval of the submitted report. \n\nRequirements: \n\n- Proficiency in English. \n\n- Ability to take clear photographs of the facility. \n\n- Experience updating a Word Document template with pictures and details of the center. \n\n- Residing in or near the location and willing to travel to the respective center locations you are willing to audit. \n\nCenter Locations where auditors are needed: \n\nIdaho (3): Idaho Falls, Boise, Moscow \n\nLouisiana (3): Baton Rouge, Sulphur, Shreveport \n\nNorth Dakota (3): Bismarck, Williston, Fargo \n\nKentucky (2): Paducah, Lexington \n\nMontana (1): Billings \n\nSouth Carolina (2): Graniteville, Chester \n\nSouth Dakota (1): Watertown \n\nUtah (1): Orem \n\nWisconsin (1): Waukesha \n\nWyoming (1): Green River \n\nTexas (5): Harlingen, Round Rock, San Antonio, Austin, Lewisville \n\nIndiana (2): Plainfield, Kokomo\n\n Arizona (3): Flagstaff, Show Low, Tucson \n\nDelaware (1): Georgetown \n\nMinnesota (2): Eagan, Saint Paul \n\nNevada (1): Reno \n\nNorth Carolina (1): Cary\n\nWashington (1): Liberty Lake \n\nWest Virginia (2): Fairmont, Huntington",
        "author": "wanderddict",
        "url": "https://www.reddit.com/r/forhire/comments/1etmwmg/hiring_test_center_secret_shop_audits_across_us/",
        "created": "2024-08-16 17:30:43",
        "created_unix": 1723809643.0
    },
    {
        "index": 17,
        "title": "[Hiring] Outreach Executive",
        "body": "Looking to hire for my marketing agency.\n\nJob role mainly consists of contacting and coordinating with external stakeholders at scale.\n\nHowever, additional ad-hoc responsibilities may also include helping with social media management.\n\nMore information will be provided during interviews. \n\nSalary dependent on experience and any training required. The range is $200 - $1000.\n\nPlease DM with a brief overview of experience if interested. \n\n",
        "author": "questionsx100",
        "url": "https://www.reddit.com/r/forhire/comments/1etme7q/hiring_outreach_executive/",
        "created": "2024-08-16 17:03:58",
        "created_unix": 1723808038.0
    },
    {
        "index": 18,
        "title": "[Hiring] (Parttime) Cryto VA",
        "body": "# Looking to hire someone who can promote a coin staking campaign, provided content generated system. Looking for a longer-term relationship, 6-8 months.\n\nPreferred candidate from Bangladesh/India",
        "author": "just_like_that_23",
        "url": "https://www.reddit.com/r/forhire/comments/1etle2v/hiring_parttime_cryto_va/",
        "created": "2024-08-16 16:05:54",
        "created_unix": 1723804554.0
    },
    {
        "index": 19,
        "title": "[Hiring] Looking for Fitness Influencers from India",
        "body": "\nPlease carefully read before applying \n\nWe're working with a top food delivery brand on a campaign promoting healthy, protein-packed meals. We're seeking fitness influencers in Bangalore, Mumbai, Delhi, Pune, and Hyderabad.\nDetails:\n•\tFocus: Protein Bowls\n•\tInfluencers: Athletes, General Fitness (No Gymbros)\n•\tFollowers: Min 5K, Avg Views 5K+\n•\tDeliverables: 1 Reel + 1 Story\n\nWe're starting with 25 influencers, with potential to scale. DM if interested!",
        "author": "notanietzchefan",
        "url": "https://www.reddit.com/r/forhire/comments/1etj1av/hiring_looking_for_fitness_influencers_from_india/",
        "created": "2024-08-16 13:25:58",
        "created_unix": 1723794958.0
    },
    {
        "index": 21,
        "title": "[Hiring] Looking for Ad Ops Specialist | Google Ad Manager & Programmatic Advertising Expertise",
        "body": "I’m seeking an experienced Ad Operations Specialist for a project. We’re handling 10 –15M impressions/month with a $0.30 CPM, aiming to scale higher.\n\n**Must-Have:**\n\n* **Google Ad Manager Expertise**\n* **Programmatic Advertising Experience**\n* **Proven Track Record** in CPM improvement\n\nIf you’ve got the skills and experience, let’s connect!",
        "author": "Wreckless_Headhunter",
        "url": "https://www.reddit.com/r/forhire/comments/1eth4et/hiring_looking_for_ad_ops_specialist_google_ad/",
        "created": "2024-08-16 11:16:43",
        "created_unix": 1723787203.0
    },
    {
        "index": 24,
        "title": "[Hiring] Pro Elden Ring player that can defeat all DLC remembrance bosses and record it in high quality footage / 60 fps",
        "body": "I will go on a trip soon for a few weeks where I cant access my PC and run a gaming channel where I make Elden Ring full playthrough guides. Looking for an excellent PvE Elden Ring player who can defeat the DLC bosses with not much problems with a setup that I will provide (weapons, gear, talismans etc.).\n\nSince skill varies and one can kill a boss first attempt within 30 seconds, or will have to re-do a certain fight multiple times, we can discuss rates.",
        "author": "Hatserson",
        "url": "https://www.reddit.com/r/forhire/comments/1etbmdx/hiring_pro_elden_ring_player_that_can_defeat_all/",
        "created": "2024-08-16 06:20:27",
        "created_unix": 1723769427.0
    },
    {
        "index": 25,
        "title": "[Hiring] digital marketers for high fashion brand ",
        "body": "\nHi, I hope you are well\n\nI need help promoting my fashion brand.\n\nSome items are pretty pricy at  600+ dollars. \n\nMy primary clientele in the past has mainly been wealthy people in nyc and la.\n\nI sold most of my stock of resin ashtrays from season 3, however, I have lots of metal ashtrays and bandanas left and need to sell them. \n\nI am offering  $120 commission for each of the metal ashtrays you can sell and $20 on each bandana you can sell.  It’s a pretty dang high commission, but I understand these won’t sell themselves except to a very specific clientele.\n\nThe website is highviolence.net if you want to sus it out, but bear in mind, I am redoing the website today and tomorrow to optimize it better, so things look a little funky.\n\nHowever, all of the payment portals should still be working at the time of this post.\n\nIf you can help me sell these, you will be compensated generously.  \n\n\n\nDM or comment if you want in :) ",
        "author": "Xanadufriend",
        "url": "https://www.reddit.com/r/forhire/comments/1et9k3s/hiring_digital_marketers_for_high_fashion_brand/",
        "created": "2024-08-16 04:45:45",
        "created_unix": 1723763745.0
    },
    {
        "index": 26,
        "title": "[HIRING] Consulting Case Study / Pymetrics / McKinsey Solve Practice Help $40",
        "body": "Looking for someone who is familiar with the McKinsey Solve assessment or pymetrics type consulting pre-interview work to help me practice for a bit, \\~1 hour. \n\nContact: Discord: rockstarkj",
        "author": "Altruistic-Animal-24",
        "url": "https://www.reddit.com/r/forhire/comments/1et8mst/hiring_consulting_case_study_pymetrics_mckinsey/",
        "created": "2024-08-16 04:04:54",
        "created_unix": 1723761294.0
    },
    {
        "index": 28,
        "title": "[HIRING] McKinsey Solve, Consultant Case/Ecosystem Game Help $40",
        "body": "Looking for someone who knows how to navigate ecosystem games, including knowing math behind redrock case study. McKinsey solve specifically, to help me practice.\n\nContact: Discord: rockstarkj",
        "author": "Altruistic-Animal-24",
        "url": "https://www.reddit.com/r/forhire/comments/1et7vvz/hiring_mckinsey_solve_consultant_caseecosystem/",
        "created": "2024-08-16 03:32:50",
        "created_unix": 1723759370.0
    },
    {
        "index": 29,
        "title": "[Hiring] (Location OR Online) Admin site available for guest posting",
        "body": "The Techs Storm(https://thetechsstorm.uk/information) is a Professional Informative Platform. Here we will provide you only interesting content, which you will like very much. We’re dedicated to providing you the best of Informative, with a focus on dependability and Technology. We’re working to turn our passion for Informative into a booming online website. We hope you enjoy our Informative as much as we enjoy offering them to you.\n\n\n\nI will keep posting more important posts on my Website for all of you. Please give your support and love.",
        "author": "Muhammad_Umairseo",
        "url": "https://www.reddit.com/r/forhire/comments/1et7kbi/hiring_location_or_online_admin_site_available/",
        "created": "2024-08-16 03:19:22",
        "created_unix": 1723758562.0
    },
    {
        "index": 30,
        "title": "[Hiring] Someone to create a 5-7 page marketing case study template that i can edit  with my company’s branding ",
        "body": "Hey everyone, curious to know how much this would cost. \n\nI'm looking for something that I, (a caveman), can edit and customize easily in like a canva format of some sort.\n\nEverything i'm seeing on canva is only 1-2 pages, but i need something that is 5-7 pages.\n\nAnyone interested in providing me with a quote for something like this?",
        "author": "Automatic_Lack_6594",
        "url": "https://www.reddit.com/r/forhire/comments/1et7cah/hiring_someone_to_create_a_57_page_marketing_case/",
        "created": "2024-08-16 03:10:03",
        "created_unix": 1723758003.0
    },
    {
        "index": 31,
        "title": "[Hiring] ( Online) Animators for Twitter Marketing",
        "body": "Looking to hire someone who can create short and simple animated marketing videos for the purpose of a twitter campaign. Looking for a longer-term relationship, 1-3 months",
        "author": "RamseyTheGoat",
        "url": "https://www.reddit.com/r/forhire/comments/1et5qc2/hiring_online_animators_for_twitter_marketing/",
        "created": "2024-08-16 02:04:18",
        "created_unix": 1723754058.0
    },
    {
        "index": 34,
        "title": "[Hiring] Recruiter - Budget described below.",
        "body": "Hey everyone!\n\nBudget: Starting at $15/h if qualified!\n\nI am looking for someone who can help me recruit influencers, affiliates, and actresses to support my company.\n\nYou will be paid a commission to every individuals that is willing to sign with us.\n\nHere are your commission for successful recruitment:\n\n1.) Influencers: $5 - 10 CAD\n\n(Their role is to post ugc content for the company. Must meet a specific demographic and have a following)\n\n2.) Affiliates: $1 CAD\n\n(They are responsible for earning commission through Affiliation with the website program)\n\n3.) Actress: 20 CAD\n\nWe are looking for an actress to help lead our youtube channel.\n\nThere is full time opportunities depending on your background (up to 15 CAD per hour)\n\nThere are only 10 spots available for this role.",
        "author": "KkylaaD",
        "url": "https://www.reddit.com/r/forhire/comments/1et4ubv/hiring_recruiter_budget_described_below/",
        "created": "2024-08-16 01:28:10",
        "created_unix": 1723751890.0
    },
    {
        "index": 35,
        "title": "[HIRING] Pets oriented social media accounts owner",
        "body": "\nHi ! We are looking for several people that owns pets social media accounts to promote one of our clients. \n\nThe deal is simple, our client is ready to give you 15% on each sale made through your content, posts, or promotional code ! \n\nDm directly the link of your social accounts if interested ! Thank you ",
        "author": "Jerykko",
        "url": "https://www.reddit.com/r/forhire/comments/1et3oli/hiring_pets_oriented_social_media_accounts_owner/",
        "created": "2024-08-16 00:41:09",
        "created_unix": 1723749069.0
    },
    {
        "index": 37,
        "title": "[HIRING] Find 4 high Resolution Vogue Covers",
        "body": "TASK IS DONE! Thank you to u/rajdoshittheclasher  \n  \n  \nHi thank you for considering to help me.\n\nI need you to find and download 4 Vogue Covers in high quality.\n\nThe following covers are needed:\n\nMay 1989  \nOctober 1992  \nOctober 1996  \nAugust 2005\n\nThe resolution needs to be a minium of 2000x1000 and in .png format\n\nFor each located cover I will pay 2$ paypal\n\nFor any questions , feel free to reach out",
        "author": "Prof_Koehler",
        "url": "https://www.reddit.com/r/forhire/comments/1et1lug/hiring_find_4_high_resolution_vogue_covers/",
        "created": "2024-08-15 23:20:26",
        "created_unix": 1723744226.0
    },
    {
        "index": 38,
        "title": "[HIRING] RECRUITERS to find Influencers that will post UGC Content on social-media platforms. Budget described below.",
        "body": "Hey everyone!  \n  \nI am looking for someone who can help me recruit influencers, affiliates, and actresses to support my company.  \n  \nYou will be paid a commission to every individual that is willing to sign with us.  \n  \nHere are your budget/commission for successful recruitment:  \n  \n1.) Influencers: $5 - 10 CAD  \n  \n(Their role is to post ugc content for the company. Must meet a specific demographic and have a following)  \n  \n2.) Affiliates: $1 CAD  \n  \n(They are responsible for earning commission through Affiliation with the website program)  \n  \n3.) Actress: 20 CAD  \n  \nWe are looking for an actress to help lead our youtube channel.  \n  \nThere is full time opportunities depending on your background (up to 15 CAD per hour)  \n  \n  \nThere are only 10 spots available for this role.",
        "author": "popstar33",
        "url": "https://www.reddit.com/r/forhire/comments/1et1jkz/hiring_recruiters_to_find_influencers_that_will/",
        "created": "2024-08-15 23:17:53",
        "created_unix": 1723744073.0
    },
    {
        "index": 40,
        "title": "[Hiring] Recruiter ",
        "body": "Hey everyone!\n\nI am looking for someone who can help me recruit influencers, affiliates, and actresses to support my company. \n\nYou will be paid a commission to every individuals that is willing to sign with us. \n\nHere are your commission for successful recruitment: \n\n1.) Influencers: $5 - 10 CAD \n\n(Their role is to post ugc content for the company. Must meet a specific demographic and have a following) \n\n2.) Affiliates: $1 CAD\n\n(They are responsible for earning commission through Affiliation with the website program) \n\n3.) Actress: 20 CAD\n\nWe are looking for an actress to help lead our youtube channel. \n\nThere is full time opportunities depending on your background (up to 15 CAD per hour) \n\n\nThere are only 10 spots available for this role. ",
        "author": "Mr_Beast_Son",
        "url": "https://www.reddit.com/r/forhire/comments/1et1epe/hiring_recruiter/",
        "created": "2024-08-15 23:12:27",
        "created_unix": 1723743747.0
    },
    {
        "index": 42,
        "title": "[Hiring] Chatters",
        "body": "I'm currently hiring OF chatters. Join our growing team! With or without experience(training will be provided).\nLinks to my socials are below. You can send me your resume at any of them.\n\n\n🚫DON'T send me a message asking if we're still hiring. Yes we are and probably for the next few weeks or so. \n\nTG/WhatsApp: +4915750668564\n\nhttps://www.facebook.com/profile.php?id=100004765961462&mibextid=ZbWKwL\n\nhttps://www.instagram.com/_florian.bl/\n",
        "author": "tokyoraised",
        "url": "https://www.reddit.com/r/forhire/comments/1et02un/hiring_chatters/",
        "created": "2024-08-15 22:18:41",
        "created_unix": 1723740521.0
    },
    {
        "index": 43,
        "title": "[HIRING] Website Testers Needed Across the Globe! ",
        "body": "Are you ready to help improve online experiences? We’re looking for people to test our websites and provide feedback. Earn between €30 to €150 depending on the site’s complexity.\n\n**Who Can Apply?**\n\n* Residents of Germany, Australia, Austria, Belgium, Bulgaria, Croatia, Denmark, Spain, Estonia, United States, Finland, France, Greece, Hungary, Ireland, Iceland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Norway, Netherlands, Portugal, Czech Republic, Romania, United Kingdom, Singapore, Slovakia, Slovenia, Sweden, Switzerland\n* No expertise is needed—ordinary users are perfect!\n\n**What to Do:**\n\n1. **Screen record your experience on our websites:** As you navigate our websites, screen record your experience to help us identify any bugs or issues.\n2. **Provide Feedback:** Send the video and feedback via WhatsApp.\n3. **Stay Honest**: We value your honest opinions on what you like, dislike, and your suggestions for improvement.\n\n**Important:**\n\n* **No VPNs:** Please do not use VPNs or similar tools, as our websites have detection systems for these practices.\n* iPhone and Android users are welcome.\n\nInterested? Contact us via WhatsApp. +48 692 887 209 for more details. We will review applications and, if selected, you will be added to our list of testers. \n\nJoin us and make the web a better place while earning extra cash. We look forward to working with you! :)",
        "author": "Popular-War-9178",
        "url": "https://www.reddit.com/r/forhire/comments/1eszqy3/hiring_website_testers_needed_across_the_globe/",
        "created": "2024-08-15 22:05:03",
        "created_unix": 1723739703.0
    },
    {
        "index": 44,
        "title": "[HIRING] I need people to bring me clients [Commission: 20%]",
        "body": "So I'm a new freelancer with expertise in web development, web designing, branding, logo designing and many more things. \n\nI want to hire someone to get me clients. I offer 20%(negotiable) commission for every client you bring in. (Note: when I mention client I mean only the clients who actually get my services.) \n\nYou get paid immediately as I get the full payment.\nI prefer paying in crypto though we can talk about this in DM. \n\nFor any more details which I know you'll have just drop me a DM or text me on discord- @rimuru251123. \n\nLet's make some money together 😄😄. Thank you. ",
        "author": "Dhruba_Soumya_Das",
        "url": "https://www.reddit.com/r/forhire/comments/1esxetf/hiring_i_need_people_to_bring_me_clients/",
        "created": "2024-08-15 20:31:06",
        "created_unix": 1723734066.0
    },
    {
        "index": 45,
        "title": "[HIRING] Media Buyer at Fella Health",
        "body": "**Company Name:** Fella Health  \n**Hiring Manager:** Lorena, Talent Lead  \n**LinkedIn Profile:** [Lorena's LinkedIn Profile](https://www.linkedin.com/in/lrncnh/)  \n**Hiring Manager's Official Email Address:** [lorena+hiring@joinfella.com](mailto:lorena+hiring@joinfella.com)  \n**Job Title:** Media Buyer  \n**Job Description:**  \nFella Health is on a mission to help middle-aged men live 10 years longer by addressing their most pressing healthcare needs.  \nWe are seeking a highly skilled Media Buyer to join our dynamic team. In this role, you will work closely with our Head of Growth and CEO to manage and optimize our paid advertising strategy across multiple acquisition channels. You will initially focus on our fast-scaling Meta accounts and will expand efforts across platforms such as Google, Native, and Reddit.  \n**Payout:** $15,000 - $42,000 per year (total compensation including equity)  \n**Remote OK:** Yes, this is a fully remote role. LATAM and APAC only  \n**Company Website:** [Fella Health](https://www.fellahealth.com/)",
        "author": "elisha_FellaHealth",
        "url": "https://www.reddit.com/r/forhire/comments/1esw2uu/hiring_media_buyer_at_fella_health/",
        "created": "2024-08-15 19:36:17",
        "created_unix": 1723730777.0
    },
    {
        "index": 48,
        "title": "[Hiring] Non CDL Local Delivery Truck Driver",
        "body": "We are looking Non CDL Local Delivery Truck Drivers.   \nAll drivers run daily routes with frequent stops and are required to load packages onto hand trucks and unload product at each stop on the assigned route in the order they are designated by the Transportation Department Manager. Rate  40/h\n\n ~Responsibilities:~\n\n* Runs routes efficiently, meeting or exceeding designated route times\n* Unload product from trailer, by hand or using hand cart, and place in designated customer storage areas.  May include transporting product down ramps, stairs, or docks, in all weather conditions. \n\n# Education and Experience:\n\n* High School or GED or equivalent\n\n* One year route delivery experience or applicable background driving a straight truck\n\nLocation Oak Creek  WI  53154",
        "author": "Intelligent_Bill7630",
        "url": "https://www.reddit.com/r/forhire/comments/1estgr7/hiring_non_cdl_local_delivery_truck_driver/",
        "created": "2024-08-15 17:36:45",
        "created_unix": 1723723605.0
    },
    {
        "index": 49,
        "title": "[Hiring] Forklift Driver - 3rd Shift",
        "body": "We are looking Forklift Driver \n\n  \nDaily functions:\n\n1. Move pallets of material around warehouse, properly label pallets, and accurately track inventory.\n2. Will work both on and off the forklift.\n3. Load palletizer \n4. Using palletizer to wrap pallets.\n\nDesired qualifications:\n\n* 3 years previous forklift experience required on a sit-down forklift.\n* Forklift test will be given on the first day.\n\n Pay: $21/Hour\n\nSchedule: Night Shift, Mon-Fri. Will start working the 2:30PM-11PM shift, then will likely be moving to 4:30PM-1AM. O/T will be required with the occasional 6PM-6AM shift.\n\nLocation: St Paul, MN ",
        "author": "Intelligent_Bill7630",
        "url": "https://www.reddit.com/r/forhire/comments/1estdzi/hiring_forklift_driver_3rd_shift/",
        "created": "2024-08-15 17:32:49",
        "created_unix": 1723723369.0
    },
    {
        "index": 50,
        "title": "[Hiring] Account Growth Manager",
        "body": "We are looking  Account Growth Manager who   will not only create incremental sales but will lead and motivate stores and their team members by example. Rate $66560 / year\n\n Requirements \n\n* Bachelor's Degree in Business Administration or related discipline (or 5+ years relevant work experience).\n* Deep understanding of retail operations, relationship sales skills, inventory management and business fundamentals.\n\nLocation Livermore CA",
        "author": "Intelligent_Bill7630",
        "url": "https://www.reddit.com/r/forhire/comments/1est6r9/hiring_account_growth_manager/",
        "created": "2024-08-15 17:22:38",
        "created_unix": 1723722758.0
    },
    {
        "index": 51,
        "title": "[Hiring] Django developer for educational game. Experience with websocket (django-channels) is a must. Full time, $30-40/hr DOE",
        "body": "Its Tron light cycles, but to turn, the user must solve a math problem. Super fun.\n\nIts online multiplayer, with a custom game lobby. I built this game 4 years ago, and after all this time, I found an edtech accelerator who wants to invest. \n\nIts hosted at heroku. We can host wherever as long as the price makes sense. \n\nStack: python, Django, postgresql, jQuery\n\nI know. I'm oldschool. I won't be coding; I will be handling marketing and sales. \n\nWe can rewrite it if you want. It needs to be upgraded from channels 2 to channels 3 anyway.\n\nThe code is super sloppy, and I apologize in advance.\n\nIf youre interested, send me a message with your linkedin, and your most impressive accomplishment.\n\nThanks ",
        "author": "just_legalism",
        "url": "https://www.reddit.com/r/forhire/comments/1essk4p/hiring_django_developer_for_educational_game/",
        "created": "2024-08-15 16:47:45",
        "created_unix": 1723720665.0
    },
    {
        "index": 52,
        "title": "[Hiring] Remote Mental Health Therapist -  WI - Eagle - Pay: $77.00 - $105.00 per hour",
        "body": "**Benefits of Joining SonderMind:**\n\n* **Flexibility**: Enjoy the freedom to set your own working hours and maintain a healthy work-life balance\n* **\\* Coming Soon! Free and stress-free credentialing with major insurers:** We have streamlined the credentialing process and handle all the hard stuff for you so that you can expand your practice by accepting insurance from major payors in your state in weeks, not months.\n* **\\*Coming Soon! Exclusive Insurance Payor Access:** Only SonderMind provides complimentary credentialing for both traditional Medicare and Medicare Advantage plans, including Humana and United Healthcare.\n* **Clinical Autonomy**: SonderMind values your clinical expertise and empowers you to make informed decisions about treatment approaches\n* **Supportive Community:** Access a network of like-minded therapists, dedicated support from our platform, and ongoing opportunities for collaboration and growth\n* **Guaranteed Pay:** We handle all the billing for you and guarantee pay bi-weekly for completed sessions-including no-shows\n* **Thoughtful client matching and dedicated coaches to grow your practice:** We help you get paired with individuals who are ideal clinical matches so that you can control and personalize your caseload, and a dedicated coach to help you help your clients, no matter what your specialty, from pediatric to geriatric mental health, trauma, anxiety or addiction, we help you help others\n* **Professional Development:** SonderMind is committed to helping therapists grow professionally, offering ongoing training and resources to enhance skills\n* **Absolutely no fees or membership charges**: We don’t charge you to deliver care, and all of the features, access, tools, and resources you get come free of charge\n\n**Requirements:**\n\n* Master's degree or higher in counseling, psychology, social work, or a related field.\n* Must be fully licensed by the State Board to provide therapy independently and without supervision (e.g., LPC, LCSW, LMFT, LMHC, LCPC, LCSW-C, LISW, or LP).\n\n**Pay: $77-$105 per hour. Pay rates vary based on the provider license type, session location, and session types.**\n\nJob Types: Full-time, Part-time, Contract\n\nPay: $77.00 - $105.00 per hour\n\nBenefits:\n\n* Flexible schedule\n\nSchedule:\n\n* Monday to Friday\n* Weekends as needed\n\nEducation:\n\n* Master's (Required)\n\nLicense/Certification:\n\n* LCSW, LMFT, LPC or LP license in Wisconsin (Required)\n\nWork Location: Remote",
        "author": "Away_Slip2803",
        "url": "https://www.reddit.com/r/forhire/comments/1essf4s/hiring_remote_mental_health_therapist_wi_eagle/",
        "created": "2024-08-15 16:39:49",
        "created_unix": 1723720189.0
    },
    {
        "index": 53,
        "title": "[Hiring] Remote Mental Health Therapist -  WI - Portage - Pay: $77.00 - $105.00 per hour",
        "body": "**Benefits of Joining SonderMind:**\n\n* **Flexibility**: Enjoy the freedom to set your own working hours and maintain a healthy work-life balance\n* **\\* Coming Soon! Free and stress-free credentialing with major insurers:** We have streamlined the credentialing process and handle all the hard stuff for you so that you can expand your practice by accepting insurance from major payors in your state in weeks, not months.\n* **\\*Coming Soon! Exclusive Insurance Payor Access:** Only SonderMind provides complimentary credentialing for both traditional Medicare and Medicare Advantage plans, including Humana and United Healthcare.\n* **Clinical Autonomy**: SonderMind values your clinical expertise and empowers you to make informed decisions about treatment approaches\n* **Supportive Community:** Access a network of like-minded therapists, dedicated support from our platform, and ongoing opportunities for collaboration and growth\n* **Guaranteed Pay:** We handle all the billing for you and guarantee pay bi-weekly for completed sessions-including no-shows\n* **Thoughtful client matching and dedicated coaches to grow your practice:** We help you get paired with individuals who are ideal clinical matches so that you can control and personalize your caseload, and a dedicated coach to help you help your clients, no matter what your specialty, from pediatric to geriatric mental health, trauma, anxiety or addiction, we help you help others\n* **Professional Development:** SonderMind is committed to helping therapists grow professionally, offering ongoing training and resources to enhance skills\n* **Absolutely no fees or membership charges**: We don’t charge you to deliver care, and all of the features, access, tools, and resources you get come free of charge\n\n**Requirements:**\n\n* Master's degree or higher in counseling, psychology, social work, or a related field.\n* Must be fully licensed by the State Board to provide therapy independently and without supervision (e.g., LPC, LCSW, LMFT, LMHC, LCPC, LCSW-C, LISW, or LP).\n\n**Pay: $77-$105 per hour. Pay rates vary based on the provider license type, session location, and session types.**\n\nJob Types: Full-time, Part-time, Contract\n\nPay: $77.00 - $105.00 per hour\n\nBenefits:\n\n* Flexible schedule\n\nSchedule:\n\n* Monday to Friday\n* Weekends as needed\n\nEducation:\n\n* Master's (Required)\n\nLicense/Certification:\n\n* LCSW, LMFT, LPC or LP license in Wisconsin (Required)\n\nWork Location: Remote",
        "author": "Responsible_Leg7319",
        "url": "https://www.reddit.com/r/forhire/comments/1essd1k/hiring_remote_mental_health_therapist_wi_portage/",
        "created": "2024-08-15 16:36:36",
        "created_unix": 1723719996.0
    },
    {
        "index": 55,
        "title": "[Hiring] Remote Mental Health Therapist WI - Milton - Pay: $77.00 - $105.00 per hour",
        "body": "**Benefits of Joining SonderMind:**\n\n* **Flexibility**: Enjoy the freedom to set your own working hours and maintain a healthy work-life balance\n* **\\* Coming Soon! Free and stress-free credentialing with major insurers:** We have streamlined the credentialing process and handle all the hard stuff for you so that you can expand your practice by accepting insurance from major payors in your state in weeks, not months.\n* **\\*Coming Soon! Exclusive Insurance Payor Access:** Only SonderMind provides complimentary credentialing for both traditional Medicare and Medicare Advantage plans, including Humana and United Healthcare.\n* **Clinical Autonomy**: SonderMind values your clinical expertise and empowers you to make informed decisions about treatment approaches\n* **Supportive Community:** Access a network of like-minded therapists, dedicated support from our platform, and ongoing opportunities for collaboration and growth\n* **Guaranteed Pay:** We handle all the billing for you and guarantee pay bi-weekly for completed sessions-including no-shows\n* **Thoughtful client matching and dedicated coaches to grow your practice:** We help you get paired with individuals who are ideal clinical matches so that you can control and personalize your caseload, and a dedicated coach to help you help your clients, no matter what your specialty, from pediatric to geriatric mental health, trauma, anxiety or addiction, we help you help others\n* **Professional Development:** SonderMind is committed to helping therapists grow professionally, offering ongoing training and resources to enhance skills\n* **Absolutely no fees or membership charges**: We don’t charge you to deliver care, and all of the features, access, tools, and resources you get come free of charge\n\n**Requirements:**\n\n* Master's degree or higher in counseling, psychology, social work, or a related field.\n* Must be fully licensed by the State Board to provide therapy independently and without supervision (e.g., LPC, LCSW, LMFT, LMHC, LCPC, LCSW-C, LISW, or LP).\n\n**Pay: $77-$105 per hour. Pay rates vary based on the provider license type, session location, and session types.**\n\nJob Types: Full-time, Part-time, Contract\n\nPay: $77.00 - $105.00 per hour\n\nBenefits:\n\n* Flexible schedule\n\nSchedule:\n\n* Monday to Friday\n* Weekends as needed\n\nEducation:\n\n* Master's (Required)\n\nLicense/Certification:\n\n* LCSW, LMFT, LPC or LP license in Wisconsin (Required)\n\nWork Location: Remote",
        "author": "Top-Dragonfruit5846",
        "url": "https://www.reddit.com/r/forhire/comments/1ess9kx/hiring_remote_mental_health_therapist_wi_milton/",
        "created": "2024-08-15 16:31:06",
        "created_unix": 1723719666.0
    },
    {
        "index": 56,
        "title": "[Hiring] Remote Mental Health Therapist - WI - Theresa - Pay: $77.00 - $105.00 per hour",
        "body": "**Benefits of Joining SonderMind:**\n\n* **Flexibility**: Enjoy the freedom to set your own working hours and maintain a healthy work-life balance\n* **\\* Coming Soon! Free and stress-free credentialing with major insurers:** We have streamlined the credentialing process and handle all the hard stuff for you so that you can expand your practice by accepting insurance from major payors in your state in weeks, not months.\n* **\\*Coming Soon! Exclusive Insurance Payor Access:** Only SonderMind provides complimentary credentialing for both traditional Medicare and Medicare Advantage plans, including Humana and United Healthcare.\n* **Clinical Autonomy**: SonderMind values your clinical expertise and empowers you to make informed decisions about treatment approaches\n* **Supportive Community:** Access a network of like-minded therapists, dedicated support from our platform, and ongoing opportunities for collaboration and growth\n* **Guaranteed Pay:** We handle all the billing for you and guarantee pay bi-weekly for completed sessions-including no-shows\n* **Thoughtful client matching and dedicated coaches to grow your practice:** We help you get paired with individuals who are ideal clinical matches so that you can control and personalize your caseload, and a dedicated coach to help you help your clients, no matter what your specialty, from pediatric to geriatric mental health, trauma, anxiety or addiction, we help you help others\n* **Professional Development:** SonderMind is committed to helping therapists grow professionally, offering ongoing training and resources to enhance skills\n* **Absolutely no fees or membership charges**: We don’t charge you to deliver care, and all of the features, access, tools, and resources you get come free of charge\n\n**Requirements:**\n\n* Master's degree or higher in counseling, psychology, social work, or a related field.\n* Must be fully licensed by the State Board to provide therapy independently and without supervision (e.g., LPC, LCSW, LMFT, LMHC, LCPC, LCSW-C, LISW, or LP).\n\n**Pay: $77-$105 per hour. Pay rates vary based on the provider license type, session location, and session types.**\n\nJob Types: Full-time, Part-time, Contract\n\nPay: $77.00 - $105.00 per hour\n\nBenefits:\n\n* Flexible schedule\n\nSchedule:\n\n* Monday to Friday\n* Weekends as needed\n\nEducation:\n\n* Master's (Required)\n\nLicense/Certification:\n\n* LCSW, LMFT, LPC or LP license in Wisconsin (Required)\n\nWork Location: Remote",
        "author": "Difficult-Hyena-7318",
        "url": "https://www.reddit.com/r/forhire/comments/1esrvqw/hiring_remote_mental_health_therapist_wi_theresa/",
        "created": "2024-08-15 16:07:36",
        "created_unix": 1723718256.0
    },
    {
        "index": 57,
        "title": "[Hiring] (Online) AI engineer / Expert AI / AI model trainer (LoRa / Stable diffusion)",
        "body": "$ 5000-6000\n\nWe are looking for an AI/StableDiffusion engineer as a full-time project employee.\n\nThe job is mostly related to high quality training of LORA, composing prompts related to certain scenes (based on sketches from artist) and programming on Python. We are currently in prove-of-concept phase and need to run many experiments to get certain results (can explain on the call).\n\nThe job also includes research of new technologies related to SD/other AI networks\n\nThe work process includes daily/on-demand calls, weekly reports, etc.\n\n In addition to AI related knowledge, following skills are required:\n\n-  Linux, advanced CLI commands\n\n-  SQL\n\n-  Basic image processing (transparency, simple drawings, scaling, rotation)\n\n-  Advanced Python programming (image processing pipelines, training pipelines)\n\n-  English (reading/writing. Speaking is highly welcomed)\n\n\n\nContact me and we will be happy to discuss our project! \n\nWe consider Russian-speaking specialists. The preferred time zone is UTC+3 or similar.",
        "author": "CompetitiveLawyer274",
        "url": "https://www.reddit.com/r/forhire/comments/1esrg5u/hiring_online_ai_engineer_expert_ai_ai_model/",
        "created": "2024-08-15 15:39:04",
        "created_unix": 1723716544.0
    },
    {
        "index": 59,
        "title": "[Hiring] Detail-Oriented Short-Form Video Editors Committed to Enhancing Content Value through Creative Editing",
        "body": "Position: Short Form Video EditorCompensation: $20 - $30 per 1-minute edit. (It's tier based, based on how many videos you've already edited for us this is so that we know you are in it for the long term)Workload: 1 to 5 videos per day, depending on your capacityDuration: Long-termPayment Schedule: After every 10 videos\n\nOverview:We are seeking skilled video editors who do more than simply overlay random B-roll or highlight keywords. Our goal is for each edit to enhance the value of the spoken content. This means using edits to effectively represent concepts or points, making a lasting impression on the viewer by educating them about the subject. Candidates should be willing to conduct brief research on the topics to ensure the edits are relevant and impactful.\n\nTop Compensation:Our highest-paid video editor earns $30 per 1-minute short and has accrued over $10,000 with us. Proof of earnings will be provided during the interview.\n\nSample Work:Applicants will be required to edit a sample clip to help us assess your understanding of our needs. This sample is solely for evaluation purposes and not meant as free labor. If we use your sample video, you will be compensated; if the sample does not meet our standards, it will not be used.\n\nApplication Process:If you are interested, please direct message me to discuss further. In the DM please only show me portfolio where you made the content more valuable through animations / graphics to explain a certain concept and not just random brolls and emojis.",
        "author": "gomey93",
        "url": "https://www.reddit.com/r/forhire/comments/1esp9ql/hiring_detailoriented_shortform_video_editors/",
        "created": "2024-08-15 13:08:53",
        "created_unix": 1723707533.0
    },
    {
        "index": 60,
        "title": "[Hiring] Programmer / Co-Founder",
        "body": "Hi everyone!\n\nsearching for a Programmer / Co-Founder for a Start-Up Business! \n\nThe company will be founded in Germany, but with 100% remote work, it will be possible to work from anywhere in the world. Basic knowledge of German would be desirable.\n\nIt would be highly beneficial if you have experience in programming cloud software and apps.\n\nShort Overview: \n\nMeddoc-Technologies is envisioned as an innovative startup specializing in the development of advanced software solutions for the healthcare sector. The goal is to significantly improve the efficiency and quality of healthcare through the use of cutting-edge technologies. The plan includes offering user-friendly platforms for patient management, AI-powered diagnostic tools, and data-driven decision support systems that seamlessly integrate into existing infrastructures. With a strong focus on data security and close collaboration with medical professionals, Meddoc-Technologies aims to transform and modernize the healthcare sector sustainably.\n\nJust leave a DM and let us make things happen!",
        "author": "Meddoc-Technologies",
        "url": "https://www.reddit.com/r/forhire/comments/1esowe2/hiring_programmer_cofounder/",
        "created": "2024-08-15 12:43:51",
        "created_unix": 1723706031.0
    },
    {
        "index": 63,
        "title": "[Hiring]Mid to senior Angular Developer",
        "body": "I am looking for mid to senior angular developer. 100% remote, full time (can’t do moonlighting).\nLooking for someone from India.\n\nMinimum 4 years experience. Immediate availability preference. \n\nAbout us: we are a startup and working on very interesting projects. \n\nQualities: Must have delivered or involved in production grade applications in the past.\n\nAbility to write unit tests is a plus\nExcellent troubleshooting skills. Know your craft.\nAbility to train new junior developers.\n\nSalary: 6 lacks to 8 lacks per annum. Depending on your experience. 100% remote.\n\nIf you are not confident about your skill set, please don’t apply. \n\n\n",
        "author": "EquipmentNo5176",
        "url": "https://www.reddit.com/r/forhire/comments/1esin9r/hiringmid_to_senior_angular_developer/",
        "created": "2024-08-15 06:55:28",
        "created_unix": 1723685128.0
    },
    {
        "index": 66,
        "title": "[HIRING] Roblox Game Dev (Lua script writer) ",
        "body": "Hey! I’m looking for someone to code some elements for me. The model is already made I just need someone who is better at coding than I am. \n\nShould be a quick project. \n\nProject:\n\nCreate a Plinko game using model \nGame uses Betting system (in game currency) \n\nThe game is a casino game. So i’d like the player to be able to bet in game currency and wherever the ball lands in the plinko game is what the bet is multiplied by (i.e x0.2 x0.5 x2 x5 etc) \n\nHoping to pay $30-$45 \nDM me on Discord @r0xstaar or PM me here on reddit ",
        "author": "LilFruitSnack420",
        "url": "https://www.reddit.com/r/forhire/comments/1esdsal/hiring_roblox_game_dev_lua_script_writer/",
        "created": "2024-08-15 03:19:36",
        "created_unix": 1723672176.0
    },
    {
        "index": 72,
        "title": "[HIRING] English Native Speaker Call Supporter\n",
        "body": "**Company: KCM Software**\n\n**Location: Remote**\n\n**About Us:** KCM Software is a dynamic and innovative software company dedicated to providing cutting-edge solutions for businesses of all sizes. We pride ourselves on delivering exceptional customer service and creating a supportive and inclusive work environment.\n\n**Job Description:** We are seeking an enthusiastic and articulate English native speaker to join our team as a Call Supporter. In this role, you will be responsible for handling incoming calls from our clients, providing exceptional customer service, and resolving any issues or inquiries they may have.\n\n**Responsibilities:**\n\n* Answer incoming calls and respond to customer inquiries in a friendly and professional manner.\n* Provide accurate information about our products and services.\n* Troubleshoot and resolve customer issues efficiently.\n* Document customer interactions and follow up on outstanding issues.\n* Collaborate with other team members to ensure customer satisfaction.\n* Maintain a high level of product knowledge to provide informed support.\n\n**Requirements:**\n\n* Native English speaker with excellent verbal communication skills.\n* Previous experience in customer service or call support is preferred.\n* Strong problem-solving skills and attention to detail.\n* Ability to work independently and as part of a team.\n* Proficient in using computer systems and software applications.\n* Reliable internet connection and a quiet work environment.\n\n**Benefits:**\n\n* Competitive salary.\n* Flexible working hours.\n* Opportunity to work remotely.\n* Professional development and training opportunities.\n* Supportive and collaborative team environment.\n\n**Payrate:**\n\nPayrate is fixed per meeting, which is $30 USD per one meeting with the client.\n\n**How to Apply:** If you are passionate about providing excellent customer service and meet the above requirements, we would love to hear from you! Please send your resume and a cover letter to [draganrapic65@gmail.com](mailto:draganrapic65@gmail.com) with the subject line \"English Native Speaker Call Supporter Application.\"\n\n",
        "author": "Dizzy_Bicycle2302",
        "url": "https://www.reddit.com/r/forhire/comments/1es8dvf/hiring_english_native_speaker_call_supporter/",
        "created": "2024-08-14 23:30:20",
        "created_unix": 1723658420.0
    },
    {
        "index": 73,
        "title": "[HIRING] 🚀 Remote React Web Engineer (Mid/Senior) 🌎 | LATAM",
        "body": "Are you a talented React Web Engineer looking to make an impact in a fast-paced and dynamic environment? We're on the lookout for someone who thrives in a lean development setting and is ready to take their front-end skills to the next level.\n\n**What You'll Be Doing:**\n\n* Collaborating effectively within a lean, accelerated development environment.\n* Building engaging, visually complex user interfaces that captivate users.\n* Adhering to common UI guidelines and standards for both web and mobile applications.\n\n**What We're Looking For:**\n\n* **Front-End Development:** Proven experience in React web-application development.\n* **Web Development:** Solid background in building responsive and high-performing web applications.\n* **Tech Stack Expertise:** Proficiency in React, TailwindCSS, Redux, SCSS, APIs, and Axios.\n\n**Why Join Us?**\n\n* Work remotely within the LATAM region with a team that's passionate about creating cutting-edge solutions.\n* Be part of a company that values innovation, creativity!\n\nHourly Pay Starting from $12/Hr (Varies on experience)\n\nPM For more details!",
        "author": "Admirable_Virus_5000",
        "url": "https://www.reddit.com/r/forhire/comments/1es86ak/hiring_remote_react_web_engineer_midsenior_latam/",
        "created": "2024-08-14 23:21:54",
        "created_unix": 1723657914.0
    },
    {
        "index": 75,
        "title": "[Hiring] DATA QUALITY TESTER - 8 TO 16 LPA",
        "body": "Data Quality Tester\n\nIndia-Remote\n\nExperience: 5+\n\nSend resumes to [alex@innoverglobalinc.com](mailto:alex@innoverglobalinc.com)\n\n• Must have E-commerce Experience\n\n• Experience working with C#, Python, SQL",
        "author": "Front_Succotash_417",
        "url": "https://www.reddit.com/r/forhire/comments/1es3n55/hiring_data_quality_tester_8_to_16_lpa/",
        "created": "2024-08-14 20:22:51",
        "created_unix": 1723647171.0
    },
    {
        "index": 76,
        "title": "[HIRING] Help Develop Stories",
        "body": "Looking for a writer to help me outline, brainstorm, and write NSFW male/male shrinking stories. No limits and need someone with a large imagination, good grammar, and enthusiasm. If you’re easily bothered by NSFW content, this isn’t the job for you. \n\n$15 per hour for planning, brainstorming. We can discuss per word rate for writing. ",
        "author": "Aggressive-Rip2532",
        "url": "https://www.reddit.com/r/forhire/comments/1es2ti5/hiring_help_develop_stories/",
        "created": "2024-08-14 19:49:43",
        "created_unix": 1723645183.0
    },
    {
        "index": 79,
        "title": "[Hiring] Greek to English translator for business communications",
        "body": "I am looking to find someone living in Greece and ideally close to the town Moria. You would be a translator between myself and a local business, either by phone or email. I would also need you to be able to receive products and have them shipped to me in Canada, though this might not be needed. This would all be paid for myself on top of your hourly wage of 15 CAD/hour.\n\nFeel free to ask any questions.",
        "author": "Genkeptnoo",
        "url": "https://www.reddit.com/r/forhire/comments/1eryxkq/hiring_greek_to_english_translator_for_business/",
        "created": "2024-08-14 16:45:07",
        "created_unix": 1723634107.0
    },
    {
        "index": 81,
        "title": "[Hiring] Long/Short form video editor",
        "body": "I am looking to hire a video editor who has plenty of experience in long and/or short form videos. The style I'm looking for varies, so I'm open to any style of editing. \n\nTalking head/business niche is preferred.\n\nPayment is based on the complexity of the project (will be discussed in DMs)\n\nPlease send me your best edits and your portfolio (no portfolio no response)\n\nCheers",
        "author": "Arnii28",
        "url": "https://www.reddit.com/r/forhire/comments/1erxyu5/hiring_longshort_form_video_editor/",
        "created": "2024-08-14 15:47:34",
        "created_unix": 1723630654.0
    },
    {
        "index": 82,
        "title": "[Hiring] Chatters with 1yr+ Experience",
        "body": "**Our Agency is looking for talented professionals to manage subscriber interactions for our client's Onlyfans account.**\n\nAs a skilled chatter, you'll use your communication expertise and understanding of Western culture to craft personalized experiences that resonate with our subscribers.\n\n**What You’ll Do:**\n\n* Build authentic connections through relatable and engaging conversations.\n* Identify and cater to the unique interests and needs of each subscriber.\n* Utilize persuasive techniques to create win-win situations.\n* Ensure loyalty and satisfaction through outstanding aftercare.\n\n**What We’re Looking For:**\n\n* **Experience:** 1+ year of experience in OF chatting.\n* **Language Skills:** Strong English proficiency with a good grasp of colloquial expressions.\n* **Sales Ability:** Proven track record in driving sales and growth.\n* **Tech Savvy:** Reliable internet connection and proficiency with online platforms.\n* **Psychological Insight:** Experience with psychological sales tactics and relationship-building.\n\n**What We Offer:**\n\n* Competitive pay with opportunities for growth and advancement.\n* Attractive bonuses and commissions.\n\n**How to Apply:** If you’re a motivated and skilled chatter, we want to hear from you! Please send your application to jacob\\_heuer on Telegram, including:\n\n* A brief introduction and summary of your experience.\n* Your approach to building relationships and driving sales.\n* Any relevant qualifications or certifications.\n\n**Note:** Applications are only accepted via Telegram at jacob\\_heuer. We look forward to your application!",
        "author": "CSM_Lance",
        "url": "https://www.reddit.com/r/forhire/comments/1erwxin/hiring_chatters_with_1yr_experience/",
        "created": "2024-08-14 14:39:20",
        "created_unix": 1723626560.0
    },
    {
        "index": 83,
        "title": "[Hiring] Automotive Technician / Mechanic",
        "body": "We are looking for technicians/mechanics who are energetic, upbeat, and have a positive attitude. The technicians we are looking for have to seek out solutions to tough problems with a strong passion for doing what’s right for our guests. Rate up to $50/h  \nQualifications: \n\n* Positive attitude and a desire to serve guests\n* 3+ years of experience as an automotive technician/mechanic\n* ASE Certifications preferred, or a plan to achieve\n\nLocation:   8700 E. Thomas Rd., Scottsdale, AZ 85251",
        "author": "No_Hat_1981",
        "url": "https://www.reddit.com/r/forhire/comments/1ervy2x/hiring_automotive_technician_mechanic/",
        "created": "2024-08-14 13:31:56",
        "created_unix": 1723622516.0
    },
    {
        "index": 84,
        "title": "[Hiring] Maintenance Technician",
        "body": "We are looking Maintenance Technician who will assist and work with the Maintenance Supervisor and Community Manager to perform the necessary repairs and preventive maintenance throughout the entire property.  Rate 30/h  \nPosition Requirements:\n\n~Education:~  High school diploma or GED required. Pool certification preferred; prefer HVAC certification, boiler certification if appropriate.\n\n~Experience~:  One year maintenance experience in residential property experience.\n\nLocation:Columbia, MO-65203",
        "author": "No_Hat_1981",
        "url": "https://www.reddit.com/r/forhire/comments/1ervt52/hiring_maintenance_technician/",
        "created": "2024-08-14 13:22:38",
        "created_unix": 1723621958.0
    },
    {
        "index": 85,
        "title": "[Hiring] Local Delivery Truck Driver",
        "body": "We are looking  a Class C Special Delivery Truck Drivers to safely and efficiently operate a truck, and manually unload/deliver various products (meats, produce, frozen foods, groceries, dry goods, supplies, etc.) to customer locations on an assigned route schedule.  \nRate 30/h+  \nRequirements\n\n* 21+ years of age.\n* Class A preferred\n\nLocation: Key West FL 33040",
        "author": "No_Hat_1981",
        "url": "https://www.reddit.com/r/forhire/comments/1ervq4r/hiring_local_delivery_truck_driver/",
        "created": "2024-08-14 13:16:44",
        "created_unix": 1723621604.0
    },
    {
        "index": 86,
        "title": "[Hiring] Retail Sales Associate",
        "body": "As a Retail Sales Associate, you’ll be the face   for everyone who visits our stores. We’ll train you with the skills and knowledge you need to confidently recommend the right tech products and solutions for each customer. Rate 20/h Not a remote postion  \nQualifications: \n\n* Working and thriving in a fast-paced, team-oriented environment\n* Working a flexible schedule that matches your availability (weekends, nights, holidays, etc.)\n\nLocation:  KY - Oak Grove",
        "author": "No_Hat_1981",
        "url": "https://www.reddit.com/r/forhire/comments/1ervnc2/hiring_retail_sales_associate/",
        "created": "2024-08-14 13:11:29",
        "created_unix": 1723621289.0
    },
    {
        "index": 87,
        "title": "[Hiring] Senior QA Engineer - Vietnam",
        "body": "  \nWe're looking for a Vietnam based Senior QA Engineer to join our team  \n  \nJoin a dynamic team at the forefront of cyberthreat intelligence as our Senior QA. You'll work with cutting-edge technology alongside some of the brightest minds in the industry, contributing to software that actively shapes the evolving landscape of cybersecurity.\n\nReporting to the Head of Development, your expertise in coding will be essential as you lead QA efforts and collaborate with the team to build impactful, production-ready services. You'll play a key role in ensuring the quality of every release, driving innovation, and mentoring your colleagues.\n\n**Key Responsibilities**\n\n* **QA Leadership:** Take charge of the QA process, ensuring each product release meets the highest standards.\n* **Feature Testing:** Conduct daily tests on features, including both UI and API components.\n* **Bug Management:** Isolate and reproduce bugs, accurately assessing their severity and impact.\n* **Sprint Collaboration:** Actively participate in sprint planning and review meetings to align with development goals.\n* **Unit Test Quality:** Work closely with the development team to maintain and enhance the quality of unit tests.\n* **Innovation:** Research and explore new technologies, libraries, models, and tools to stay ahead in the field.\n* **Knowledge Sharing:** Contribute to team growth by sharing your expertise and insights.\n\n**Required Skills & Qualifications**\n\n* **Experience:** 5+ years in QA, with a proven track record of leading quality assurance initiatives.\n* **Technical Proficiency:** Strong working knowledge of SQL & NoSQL databases, and familiarity with tools like Postman, Insomnia, Swagger, Kibana, and Sentry.\n* **Development Background:** Experience in development, particularly in creating integration tests using Cypress or similar tools.\n* **Analytical Skills:** Strong analytical capabilities, with a keen eye for detail.\n* **Team Collaboration:** A team player who thrives in collaborative environments.\n* **Communication:** Comfortable presenting to large internal groups and leadership teams, with fluency in English.\n\n**Benefits**\n\n* **International Team:** Be part of a fun, diverse team that values after-work and social events.\n* **Work Environment:** Enjoy a spacious office in Barcelona, complete with a kitchen and a large rooftop.\n* **Career Development:** Access a comprehensive set of tools to drive your career forward, with on-the-job training and coaching.\n* **Supportive Culture:** Work in a culture that values and respects your opinions and ideas.\n\n  \nSalary - $20K - $26K\n\nDM me if you're based in Vietnam and interested in the opportunity",
        "author": "sp3co92",
        "url": "https://www.reddit.com/r/forhire/comments/1ervmvn/hiring_senior_qa_engineer_vietnam/",
        "created": "2024-08-14 13:10:35",
        "created_unix": 1723621235.0
    },
    {
        "index": 89,
        "title": "[Hiring] Account Manager",
        "body": "We are looking Account Manager who involves maintaining and expanding a portfolio of accounts through effective communication, planning, and quality checks. This is not remote postion\n\n**Key Responsibilities:**\n\n* Build and maintain strong client relationships.\n* Prepare and deliver presentations, proposals, and sales contracts.\n* Identify and pursue new sales opportunities.\n\n**Requirements:**\n\n* High school diploma or equivalent.\n* Proficiency in Microsoft Office Suite and contact management software.\n* Valid driver’s license.\n\nRate 25/h  \nLocation:Meridian, ID-83680",
        "author": "No_Hat_1981",
        "url": "https://www.reddit.com/r/forhire/comments/1ervjnv/hiring_account_manager/",
        "created": "2024-08-14 13:04:19",
        "created_unix": 1723620859.0
    },
    {
        "index": 91,
        "title": "[Hiring] Senior Frontend Developer - Vietnam",
        "body": "We're looking for a Vietnam based Senior Frontend Engineer to join our team  \n\n\n*As a Senior Frontend Developer, your core responsibilities will involve:*\n\n* Crafting software with modern engineering techniques and agile methodologies.\n* Writing clean, efficient, and scalable code, including the implementation of automated tests.\n* Participating in sprint planning and review sessions.\n* Ensuring the delivery of high-quality solutions.\n* Playing a key role in making technical decisions.\n* Contributing to the management and reduction of technical debt.\n* Exploring and evaluating new technologies, libraries, frameworks, and tools.\n* Sharing knowledge and mentoring to support the team’s growth.\n\n*Additional Responsibilities:*\n\n* Collaborating with cross-functional teams during both the design and development phases to maintain adherence to UI architecture standards and best practices.\n* Partnering with UX designers to drive the evolution of a modern user interface.\n* Designing and developing proof-of-concept prototypes for advanced features and design ideas.\n\nIdeal Candidate Profile\n\n*What makes an exceptional candidate?*\n\n* Strong proficiency in HTML, CSS, and JavaScript/TypeScript.\n* Over 5 years of professional experience with modern JavaScript frameworks like Angular, Svelte, React, or Vue.\n* Deep understanding of software development best practices and methodologies.\n* Proficient in using Git in a professional setting.\n* Experience in diagnosing and preventing performance and optimization issues.\n* Excellent problem-solving abilities.\n* A collaborative team player.\n* Fluent in English.\n\nBenefits\n\nWhat’s in it for you? In recognition of your contributions, we offer:\n\n* A competitive salary package with 100% of your salary during the probation period.\n* Annual salary reviews and a 13th-month bonus.\n* The opportunity to work with experienced software engineers globally at a leading, innovative Scandinavian SaaS company poised for growth.\n* Flexible working hours from Monday to Friday, with no overtime.\n* A modern and dynamic working environment, complete with supportive colleagues and challenging projects.\n* A Scandinavian work culture that emphasizes creativity, innovation, and work-life balance.\n* Premium healthcare and accident insurance, including coverage for employees and their children.\n\n  \nSalary - $20K - $26K\n\nDM me if you're based in Vietnam and interested in the opportunity",
        "author": "sp3co92",
        "url": "https://www.reddit.com/r/forhire/comments/1ervf3b/hiring_senior_frontend_developer_vietnam/",
        "created": "2024-08-14 12:55:15",
        "created_unix": 1723620315.0
    },
    {
        "index": 92,
        "title": "[HIRING] Outreachers for my Creative Agency",
        "body": "Looking for: Professional and Honest Mediators Type of work: Will give 25% percentage of profit in exchange for clients (Video Editing,Thumbnail designing,Graphic designing  etc) and. Budget: The decided percentage will be consistent, it can be 10$ or 1000$ You will get commission percentage directly from the client the first time so there is no way to take advantage. After that, I will personally pay you a commission. Your job is to convince clients so please only DM if you consider yourself a professional: Good English/ Conversation Skills Good Marketing skills along with experience in the field Has to be clear and honest with clients' contact and the exact amount of transaction.",
        "author": "incthrow3210",
        "url": "https://www.reddit.com/r/forhire/comments/1erujtx/hiring_outreachers_for_my_creative_agency/",
        "created": "2024-08-14 11:58:23",
        "created_unix": 1723616903.0
    },
    {
        "index": 96,
        "title": "[Hiring] Valorant Thumbnail Creator",
        "body": "Looking for a person who can make original 3D Valorant Thumbnails. \n\nWe will pay $5 per thumbnail needed. ",
        "author": "Saniittyy",
        "url": "https://www.reddit.com/r/forhire/comments/1erom0z/hiring_valorant_thumbnail_creator/",
        "created": "2024-08-14 06:40:54",
        "created_unix": 1723597854.0
    },
    {
        "index": 104,
        "title": "[HIRING] Data Entry Role - Shopify (Remote)",
        "body": "There is a lot of work available for this project, most of it has been done, but looking for someone to help complete this so we can focus on building out functionality and updating pictures.\n\n* Scraping products from a clients existing website into our new Shopify Website\n* Inputting Product Name, Descriptions, Photos (Usually 1-3), Pricing, and Collection Filters\n* Ensuring everything is copied exactly from the previous website and adding the correct Collection details\n\nAfter completion, there is other projects to take apart in.\n\nPay: Varying +$100 - $200",
        "author": "TheDorianB",
        "url": "https://www.reddit.com/r/forhire/comments/1erddob/hiring_data_entry_role_shopify_remote/",
        "created": "2024-08-13 22:40:04",
        "created_unix": 1723569004.0
    },
    {
        "index": 106,
        "title": "[HIRING] Web Designer - Manila (On-Site) ",
        "body": "Salary: PHP 20,000 - PHP 30,000\n\nYears of experience and skills needed:\n\n* Designing and maintaining Webpages\n* Creating wireframe, prototypes, mockups for web platform.\n* Creating & providing all Brand collaterals, maintain UI & Design System.\n* Determining technical requirements\n* Knowledge on Web Front-End: HTML5 / CSS3 / JavaScript\n* Open for Filipino Citizens only \n\nIf you think you fit the qualifications, let me know so I can give you my email. Thanks! \n\n\n\n",
        "author": "Free_Fly_7389",
        "url": "https://www.reddit.com/r/forhire/comments/1erb9mr/hiring_web_designer_manila_onsite/",
        "created": "2024-08-13 21:15:46",
        "created_unix": 1723563946.0
    },
    {
        "index": 107,
        "title": "[HIRING] Product Operation Executive - Manila (On-site)",
        "body": "\\[HIRING\\] Product Operation Executive - Manila (On-site)\n\nSalary: PHP 20,000 - PHP 30,000\n\nYears of experience and skills needed:\n\n* Comprehend project initiatives and requirements to craft comprehensive business requirements.\n* Collaborate on testing procedures to ensure the timely delivery of error-free project scopes.\n* Provide adept support for all external inquiries from product providers and internal queries from departments including CS, Marketing, Product Marketing, and risk management.\n* Investigate inquiries thoroughly, delivering optimal solutions and responses to users.\n* Identify and investigate incidents, furnishing findings and provide the solutions to Team lead.\n* Open to Filipino Citizen only\n\nIf you think you fit the qualifications, let me know so I can give you my email. Thanks! \n\n",
        "author": "Free_Fly_7389",
        "url": "https://www.reddit.com/r/forhire/comments/1erb853/hiring_product_operation_executive_manila_onsite/",
        "created": "2024-08-13 21:14:07",
        "created_unix": 1723563847.0
    },
    {
        "index": 124,
        "title": "[Hiring] Artist to Draft Tattoo, $50",
        "body": "I’m looking for at least a rough draft to show my sister (who is getting matching tattoos with me) as well as the tattoo artist. Let me know if this is something you can do. ",
        "author": "offensivewarmth",
        "url": "https://www.reddit.com/r/forhire/comments/1eqoa57/hiring_artist_to_draft_tattoo_50/",
        "created": "2024-08-13 01:53:09",
        "created_unix": 1723494189.0
    },
    {
        "index": 126,
        "title": "[Hiring] Maintenance Technician SC - Richland - Pay Range: $25 - $30/hour",
        "body": "Shift Information:\n\n3rd Shift\n\n12 Hour: 7pm-7am\n\nOvertime Mandatory\n\n12-hour 3rd Shift rotates between Week 1 and Week 2. Week 1: Mon/Tues/Sat/Sun and Week 2: Wed/Thurs/Fri. Every other weekend OFF. Shift hours are 7pm - 7am.\n\nAdditional Pay Info: $1,000 Signing Bonus and $500 Referral opportunities are available.\n\nESSENTIAL FUNCTIONS:\n\n• Troubleshoots and repairs machine malfunctions. Performs preventive maintenance.\n\n• Locates and repairs electrical, hydraulic, and mechanical problems.\n\n• Completes projects as directed (machine moves, modifications, installations; material handling; remodeling work area, etc.)\n\n• Assists in the training of other maintenance personnel and production associates.\n\n• Ensures that job functions maintain or improve product quality.\n\n• Performs Preventative Maintenance functions on equipment.\n\n• Completes work orders satisfactorily and in a timely manner.\n\nPREFERRED QUALIFICATIONS:\n\n• Education Requirements: High School Diploma or GED from an accredited school.\n\n• Advanced education (associate degree) in related field or equivalent work experience preferred.\n\n• Prior work experience in a manufacturing setting is highly preferred.\n\n• Experience in working with electrical systems from 24V DC to 480V AC.\n\n• Ability to read and interpret electrical blueprints.\n\nOTHER INFORMATION:\n\n• Works well in a team environment and accomplishes projects in a timely basis with acceptable workmanship.\n\n• On-the-job or classroom training, including hydraulics, pneumatics, electrical, electronics, welding, and mechanical.\n\n• Hilift/Forklift operation experience and ability to obtain license.\n\n• Quality Management System and Environmental Systems Training\n\n• Must be able to work in a manufacturing setting, standing, bending, stooping, lifting, pulling, pushing are required.",
        "author": "Alternative_Belt_619",
        "url": "https://www.reddit.com/r/forhire/comments/1eqne8t/hiring_maintenance_technician_sc_richland_pay/",
        "created": "2024-08-13 01:19:01",
        "created_unix": 1723492141.0
    },
    {
        "index": 127,
        "title": "[Hiring] Civil Engineer - Jasper, IN ",
        "body": "**Civil Engineer Job Summary:**  \n  \nThe Civil Engineer will design, plan, and supervise the construction of site development and infrastructure projects such as buildings, bridges, roads, dams, pipelines, water, and sewage systems.  \n  \n**Duties/Responsibilities:**  \n\n\n* Manage and direct field crew activities.\n* Consult with and provide guidance to project stakeholders and managerial staff regarding engineering requirements for construction of various designs, modifications, and structural repairs.\n* Use design software and drawing tools to accurately render and communicate designs; plans and designs other necessary and related systems and structures such as transportation or hydraulics.\n* Assess strength of foundations, concrete, asphalt, or steel by testing materials and soil.\n* Set design specifications by computing load and grade requirements, material stress factors, water flow rates, and similar parameters.\n* Plan projects based on the analysis of relevant materials such as drawings, blueprints, aerial photography, survey reports, maps, and other geologic and topographical data.\n* Draft and presents reports on topics related to projects such as environmental impact statements and right-of-way descriptions.\n* Estimate materials, equipment, and labor needed to determine project costs.\n* Collaborate with architects, surveyors and contractors to ensure projects progress properly.\n* Collaborate with surveyors (or direct and participate in surveying) to establish installations or reference points, grades, elevations, and other factors that will affect construction.\n* Monitor project progress and ensure design specifications, safety, and sanitation standards are met.\n* On completion of a project, inspect, repair, and maintain the structures as needed.\n* Perform other related duties as assigned.\n\n**Required Skills/Abilities:**  \n  \n\n\n* Thorough understanding of civil engineering principles, practices, and tools.\n* Proficient in computer-assisted design (CAD) and other design, data recording, and analyzation software.\n* Thorough understanding of materials, methods, and tools involved in the construction or repair of buildings, bridges, roads, and other related structures.\n* Thorough understanding of safety regulations related to assigned projects.\n* Ability to identify and solve complex problems.\n* Excellent verbal and written communication skills.\n* Ability to be both creative and analytical.\n* Extremely detail-oriented and accurate.\n\n**Education and Experience:**  \n\n\n* Bachelor's degree in Civil Engineering required.\n* Licensure preferred but not required.\n\n**Physical Requirements:**  \n\n\n* Prolonged periods sitting at a desk and working on a computer.\n* Must be able to lift up to 15 pounds at times.\n* Must be able to travel to various project sites.\n* Must be able to access and navigate job sites and construction areas.\n\n**Salary and Hourly wages are based on experience.**  \n  \n**Benefits:**  \n  \n• Medical Benefits  \n• 401K  \n• Vision  \n• Dental  \n• Paid Time Off",
        "author": "Alternative_Belt_619",
        "url": "https://www.reddit.com/r/forhire/comments/1eqnd2e/hiring_civil_engineer_jasper_in/",
        "created": "2024-08-13 01:17:41",
        "created_unix": 1723492061.0
    },
    {
        "index": 128,
        "title": "[Hiring] Shift Lead - Full Time - MN - SHAKOPEE",
        "body": "**What’s in it for you?** \n\n-Flexible scheduling \n\n-Top pay in the industry \n\n-Education programs, including GED and Tuition Reimbursement offerings  \n\n-Scholarship opportunities \n\n-Medical/Dental/Vision benefits offered for all positions – even part-time! \n\n-Free food! \n\n-Vacation Time (Paid Time Off) \n\n-Vacation Donation Program \n\n-Border Family Cares Program \n\n-Border Smiles Program \n\n-An incredible culture that encourages career growth and support \n\nAs a Shift Leader your mission is to reinforce the Border Foods CORE values, to include Accountability, Integrity, Family, Excellence, Teamwork, and Empowerment.\n\n\n\nAt Border Foods, we will unlock the full potential of our employees and guest’s restaurant experience by creating safe welcoming and supportive environments where everyone can thrive.\n\n\n\nThe purpose of the Shift Leader is to make the lives of the employees and the guests better by creating opportunities to positively impact life experiences. You are responsible for the operation of the entire restaurant and building a strong team that consistently provides customers great food and a friendly experience.\n\n\n\n\n\n**Shift Leader Core Values:**\n\n**Accountability & Integrity:**\n\n* Consistently demonstrates integrity in actions and expectations\n* Guides team members, ensuring they complete all assigned duties and serve safe, quality food in a friendly manner\n* Scheduling and deploying the Team correctly\n* Monitors the performance of each Team Member and hold them accountable for standards and expectations.\n* Ensures a quality customer experience by driving fast and friendly service\n* Maintains point of sale system by reporting all system failures and verifies download accuracy (e.g. pricing updates, menu changes).\n* Ensure health and safety standards are met\n* Adheres to all local, state, and federal laws and guidelines.\n\n**Family & Teamwork**\n\n* Creates unity in the team by building cross functional relationships\n* Respond to Team Member questions and resolves employee issues in a timely manner.\n* Provide a restaurant that is a safe place for team members to work and customers to visit\n* Able to navigate challenging situations and provide appropriate guidance\n* Motivates and supports the team through active listening and the ability to communicate to a wide variety of audiences\n* Represents Border Foods in handling customer complaints and/or issues; demonstrating a sincere approach and desire to find an effective solution.\n* Instills a recognition culture that creates a positive work environment\n\n**Excellence:**\n\n* Strategic planner creates short term and long-term strategies for restaurant success\n* Delivers profit by utilizing and interpreting the P&L in order to make the appropriate financial adjustments\n* Sourcing, hiring, and developing excellent Team Members\n* Conducting New Hire orientation and developing the training plan for each new hire\n* Minimizes loss through strict observance of cash handling policies, proper training of Team Members, and complying with all accounting/banking requirements.\n\n**Empowerment:**\n\n* Provides learning and development opportunities for all Team Members.\n* Consistently demonstrates active and timely coaching capabilities.\n* Seeks and shares ideas to help others succeed\n\n**Required or Preferred Experience:**\n\n* Must be at least 18 years of age.\n* High school diploma or equivalent.\n\n\n\n**Physical Demands:**\n\nThe physical demands for this position are sits, stands, bends, lifts, and moves intermittently during working hours. These physical requirements may be accomplished with or without reasonable accommodation.\n\n\n\nThe duties of this position may change from time to time. Border Foods reserves the right to add or delete duties and responsibilities at the discretion of Border Foods or its managers. This job description is intended to describe the general level of work being performed. It is not intended to be all-inclusive.\n\nBorder Foods is proud to be an Equal Opportunity Employer of Minorities, Women, Protected Veterans, and individuals with Disabilities and does not discriminate based on gender identity or sexual orientation.\n\n\n\n**“You are applying for work with a franchisee of Taco Bell, not Taco Bell Corp. or any of its affiliates. If hired, the franchisee will be your only employer. Franchisees are independent business owners who set their own wage and benefit programs that can vary among franchisees.”** ",
        "author": "Alternative_Belt_619",
        "url": "https://www.reddit.com/r/forhire/comments/1eqnbiz/hiring_shift_lead_full_time_mn_shakopee/",
        "created": "2024-08-13 01:16:03",
        "created_unix": 1723491963.0
    },
    {
        "index": 130,
        "title": "[Hiring] Senior Full Stack Developer:  Remote - Indonesia or Remote - Vietnam or Remote - Philippines or Remote - Malaysia or Remote - Thailand ($25K - $42K)",
        "body": "We are developing a generative AI SaaS and product development (outsourcing) business with the mission of \"Empowering society with generative AI and product development\".\n\nWe are in the midst of rapid growth, having completed a $600,000 seed round of funding in 2022. We currently have 8 full-time members and a multinational global team including Japan, Indonesia, Vietnam, and the Philippines.\n\n# Generative AI SaaS & Partners Division\n\nWe plan to roll out the following two SaaS products in late 2024 as Generative AI SaaS:\n\n* **Beta Chat:** Importing customers' internal information and using RAGs to build their own internal knowledge base.\n* **Excel Plug-in for GPT:** A plug-in that enables GPT utilization on Excel.\n\n# Product Development (Outsourcing) Division\n\nWe have a team of experts who help progressive clients expand their business with a variety of projects, including those related to generative AI. Examples of projects include:\n\n* Development project of sales support tool using generative AI\n* Development project of a generative AI chatbot for an insurance agency\n* Marketing SaaS renewal project for one of Japan's largest advertising agency group companies\n* Mobile app development project for a major retailer using Flutter\n* SaaS development project for a welfare facility using a linear programming algorithm to automatically generate shifts\n\n# About This Job\n\nThis is a Senior Engineer position with a mission to lead product development. This position is responsible for the growth of the product and the success of the project based on a high level of expertise.\n\nA wide range of skills are required at a high level, not only in engineering, but also in project management and communication, which will greatly expand your career possibilities!\n\n# Tech-Stacks\n\n# Programming Languages Used:\n\n* **Mainly Used:** TypeScript\n* **Others:** Python, Dart\n\n# Frontend:\n\nNext.js\n\n# Backend:\n\nSupabase, AWS, GCP\n\n# Work Condition\n\n* Full remote and you can work from all over the world\n* HQ is in Tokyo but professionals can have great collaboration with all remote conditions\n\n# Selection Process\n\n* Pre technical test (Chat)\n* Culture interview (30 min)\n* Final - Technical interview (60 - 90 min)\n\n# Required Skills and Experiences\n\n* More than 4 years of experience in React/Next.js using TypeScript\n* More than 4 years of experience in server-side development using Node.js\n* Experience in using Supabase/AWS/GCP in projects\n* Has responsibility\n* Has passion for removing unnecessary coding and creating innovation\n* Has honesty and a good heart\n* Has the ability to actively grow and expand their role\n* Has a sincere attitude and can wholeheartedly engage with the product\n* Has the proactiveness to bridge the gap between expectations and reality\n\n# Read This Before Applying\n\nWe would ask for trial work for 1 month which is 100% paid. Let us know about this confirmation.\n\n# Benefits\n\nRemote working culture\n\nDistributed team\n\nResult-oriented environment\n\n# Please DM if you satisfy these requirements",
        "author": "InkalimevaII",
        "url": "https://www.reddit.com/r/forhire/comments/1eqjm33/hiring_senior_full_stack_developer_remote/",
        "created": "2024-08-12 22:51:32",
        "created_unix": 1723483292.0
    },
    {
        "index": 131,
        "title": "[Hiring] Software Development in Test: Remote - Colombo, Sri Lanka ($20K - $40K)",
        "body": "We enable companies to employ anyone, anywhere in a few clicks. Our SaaS platform combines the multi-local complexities of hiring & paying employees anywhere in the world, and automates everything. We are passionate about creating a world where people can get a job they love, without having to leave the people they love.\n\nWe are an early-stage startup with a \"Day one\" attitude and we are building a team that will make us the market leader in this space. Every day is an exciting one at our company right now because we are figuring out a real problem in the market and building a first-of-its-kind product around it. We are looking for smart and talented people who will add to our collective energy and share the same excitement in making our company a big deal. We are headquartered in Singapore, but our team is remote.\n\n# What Will I Be Doing?\n\n* Owning the quality of everything we put in front of our customer. We mean being the champion of quality no matter what it is that we deliver.\n* Working closely with our product, design, and tech teams to deliver products with the goal of delighting and increasing the success of our customers, in a very iterative fashion.\n* Working closely with all stakeholders to understand what we are building. Architecting, designing our test strategy, plans, and running them in the most efficient manner to deliver the product fast.\n* Creating an automation culture within the test team and automating at every opportunity to improve the speed and quality of testing. Work with engineers to improve integration testing.\n* Getting your hands dirty by getting into the details of the technicalities - analyzing logs, understanding the bases and the structures, understanding the tools and frameworks, and using all of them to debug and do better tests.\n* Contributing to improving test and engineering experience by evaluating, developing tools/frameworks/workflows/reporting dashboards, etc.\n\n# What Do I Need? 🤓\n\n* 4+ years of industry experience in a similar role, preferably in a SaaS product. You can demonstrate significant impact that your work has had on the product and/or the team.\n* Deep fundamental knowledge of testing principles, techniques, methods, and tools.\n* Strong experience in running testing efforts on large-scale customer-facing products and API products.\n* Knowledge and experience in scripting, coding, and automation tools.\n* Exceptional communication skills and an upbeat character who can reach out to various stakeholders and get things done in a remote setting.\n* Willingness to quickly learn and use new technologies or frameworks.\n* Extremely driven.\n* Work with and solve problems of a very complex nature and enjoy doing it.\n\nFeel free to apply even if you feel unsure about whether you meet every single requirement in this posting. As long as you're a quick learner, and are excited about changing the status quo for tech recruitment, we're happy to support you as you come up to speed with our tech stack.\n\n# Perks\n\n* Flexible vacation.\n* Flexible work times.\n* Work from anywhere.\n* Equipment you need to do your job.\n* Health Insurance.\n* Attractive ESOPs.\n\n# What Our Selection Process Looks Like\n\n* Initial screening round.\n* Technical round with our engineers.\n* Technical Interview with our Hiring Manager.\n\n# Equal Employment Opportunity\n\nWe are an equal opportunity employer: we value diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "author": "InkalimevaII",
        "url": "https://www.reddit.com/r/forhire/comments/1eqjbju/hiring_software_development_in_test_remote/",
        "created": "2024-08-12 22:40:10",
        "created_unix": 1723482610.0
    },
    {
        "index": 137,
        "title": "[Hiring] AI video creator ",
        "body": "Looking for an AI video creator. Mostly short videos less than 60 seconds. \nSpecifics will be shared in DM.",
        "author": "thea13th",
        "url": "https://www.reddit.com/r/forhire/comments/1eqfccc/hiring_ai_video_creator/",
        "created": "2024-08-12 20:04:52",
        "created_unix": 1723473292.0
    },
    {
        "index": 139,
        "title": "[Hiring] Coding Expert AI Trainer – Remote Position ",
        "body": "\n\nAre you a coding expert with a passion for AI and training? We’re looking for a highly skilled AI Trainer to join our remote team. If you excel in Python, Java, and C++, and have extensive experience with AI frameworks and libraries, this could be the perfect opportunity for you!\n\n**Qualifications:**\n- Proficient in Python, Java, and C++\n- Native English speaker\n- Expertise in AI frameworks and tools such as TensorFlow, PyTorch, Keras, and scikit-learn\n- Familiarity with remote desktop tools like AnyDesk\n- Strong communication and training skills\n\n**Position Details:**\n- **Pay:** Starting at $15/hr\n- **Type:** Remote\n\nIf you meet these qualifications and are excited about the opportunity to work remotely, please reach out with your resume and any relevant portfolio or project examples. We look forward to hearing from you!\n\nOnly 2 positions to be filled.\n\nThank you!",
        "author": "No-Hyena-7021",
        "url": "https://www.reddit.com/r/forhire/comments/1eqdlve/hiring_coding_expert_ai_trainer_remote_position/",
        "created": "2024-08-12 18:52:41",
        "created_unix": 1723468961.0
    },
    {
        "index": 141,
        "title": "[Hiring] Corporate Recruiter - IL - PEORIA",
        "body": "**Principal Duties/Responsibilities:**\n\n· Actively leads and supports all activities in the recruitment life cycle to include; candidate management, sourcing and planning through the use of social media and other sources, screening, interviewing, pre-selecting, offer management, hiring and onboarding through the HRIS system. Successfully implements cost effective recruitment strategies to fill positions (i.e., employee referrals, internet postings, networking, job fairs)\n\n· Build and manage relationships with internal stakeholders and business leaders to understand hiring forecasts and recruiting priorities in order to fill hiring needs in a timely manner\n\n· Responsible for the execution of recruiting plans and implements sourcing strategies using a combination of talent branding, external search, direct sourcing, online postings, referrals, social media, internal talent mining and other relevant methods\n\n· Responsible for the execution of recruiting plans, employing traditional sourcing strategies as well as leveraging new innovative recruitment approaches\n\n· Provide Best-in-Class candidate experience through communication, relationship building, and execution of the recruitment process\n\n· Facilitates and leads the recruiting team with strategic recruitment projects and start-up site activity\n\n· Coach managers/interview teams to incorporate capability and competency based assessments during their interview\n\n· Builds and leverages external relationships with military/technical/diversity/professional associations and schools, to help shape sourcing strategy and develop future talent pipelines\n\n· Maintains accurate and well-ordered documentation on all candidates, searches, hiring managers’ interactions, and other recruiting activities to ensure compliance with document retention\n\n· Shares recruiting best practices and driving continuous improvement across entirety of Talent Acquisition team\n\n\n\n**Knowledge, Skills, Abilities (KSAs), & Competencies:**\n\n**Essential KSAs:**\n\n· Bachelor’s degree or an equivalent level of education\n\n· Minimum of 2 years of recruiting experience\n\n· Proficient with Microsoft Office (Word, Excel, PowerPoint, and Outlook)\n\n· Excellent verbal/written communication skills\n\n· Ability to work under deadlines and competing priorities\n\n· Skilled in influencing others and relationship building\n\n· Experience with social networking and social media\n\n\n\n**Desirable KSAs:**\n\n· Degree in Business or Human Resources\n\n· Ability to work with others in a team environment\n\n· Experience in mining online databases\n\n· Results driven attitude\n\n· Have a bias towards action and be able to mobilize quickly\n\n· Recruiting in a manufacturing environment\n\n\n\n**Competencies:**\n\n· Interpersonal Skills\n\n· Task Management\n\n· Strategic Skills\n\n· Communication Skills",
        "author": "Alternative_Belt_619",
        "url": "https://www.reddit.com/r/forhire/comments/1eqdfwt/hiring_corporate_recruiter_il_peoria/",
        "created": "2024-08-12 18:45:26",
        "created_unix": 1723468526.0
    },
    {
        "index": 142,
        "title": "[Hiring] Data Scientist I - WI - SUSSEX",
        "body": "As a global marketing experience company, Quad’s goal is to help our clients win every day. We use our data-driven integrated marketing and manufacturing platform to streamline solutions for our clients, reduce friction and enhance their marketing spend effectiveness. We’ve built a rich legacy by believing in our people, allowing them to act like owners and to take charge of their own success. Whether an operator, sales rep, a graphic artist or a clinician, we’re all driven to perform at our best— for ourselves and our clients. At our core, we’re a company that believes we can always create a better way.  \n\n\n**~GENERAL PURPOSE OF JOB~**\n\nQuad is currently seeking a Data Scientist at our Headquarters in Sussex, WI. The applicant should have expertise in both predictive and prescriptive analytics.  In this role you will be a member of our data science team working closely with business partners and teammates.  This role solves the most complex analytical opportunities by developing models answering both “what will happen” (predictive) and “what should we do” (prescriptive optimization) across process and product offering at Quad.\n\nYou will contribute to all aspects of the SLDC from project scope, requirements, design, testing, deployment, and support. The ideal candidate will have a deep passion for data driven analytics, team building, collaboration and proven experience providing analytical insights to strategic decision makers at Quad. \n\nThis is challenging and rewarding work that offers outstanding long-term career opportunities. The position supports the Quad 3.0 vision, business, leadership, marketing, IT infrastructure and software development teams with insights gained from analyzing company data. \n\n**Responsibilities:**\n\n**Project Management**\n\n* Partner with project stakeholders, cross functional IT teams and your Data Science team to determine project scope, requirements, functional and technical design and expected results.\n* Work closely with Data Science Team to plan and execute deliverables according to the principals of Agile Software Development.\n\n**Algorithm & Software Development Process**\n\n* Design and implement models and algorithms in the predictive and prescriptive disciplines of data science to support strategic business decisions and automated integration with business processes/system.\n* Continuously monitor and improve existing models as business direction as corresponding data sets evolve.\n* Write automated data collection routines: processing, transforming, and storing data in support of machine learning projects.\n* Develop and automate continuous training models and required reporting.\n* Security considerations are included within scope of all software solution design.\n\n**Data Analysis & Insight**\n\n* Analyze large data sets to determine patterns and support decision making within project design to produce actionable scope.\n* Effectively present complex data concepts and recommended insights to non-technical stakeholder.\n* Collaborate with business areas and IT Development Teams to integrate data science into business processes and viable solutions.\n\n**Operational Support**\n\n* Provide timely and accurate production support responsibilities within defined SLAs to business partners.\n* Proactively engage with fellow team members, the I.T. Department and Business Stakeholders to monitor and strengthen the data science platform.\n\n**Required Qualifications**\n\n* Bachelor’s degree in data science, Math, Statistics, or related with an analytical concentration.\n* 3-5 years experience in Data Science application development and application of principals to successful business solutions.\n* Experience of neural network libraries such as Jax, PyTorch, etc.\n* Working knowledge of big data technologies (Databricks, Spark)\n* Experience with software tools such as: Python, Pandas, NumPy.\n* Demonstrated understanding and application of linear and logistic regression, probability theory or SVM, and related properties of distributions and statistical tests.\n* Demonstrated understanding and application of optimization algorithms across Gradient-Based, Second-Order and Evolutionary & Direct Search. \n* Strong problem-solving and object-oriented development skills\n* Excellent communication and technical writing skills.\n* Desire and ambition jointly build and strengthen data science solutions as part of a collaborative and respectful team environment.\n* Unrestricted Work Authorization in the US.\n\n**Preferred Qualifications**\n\n* Experience SQL and database management platforms.\n* Experience developing and deploying software in Kubernetes.\n* Experience in Azure DevOps Services and pipeline management.\n* Experience in Azure Cloud Services or other cloud platforms.\n\nWe offer excellent benefits to eligible employees, including 401(k), holidays, vacations and more.Quad is proud to be an equal opportunity employer and values diversity. We are committed to creating a place of belonging — a space where employees do not need to sacrifice who they are to exist and grow in our workplace. Quad does not discriminate on any unlawful basis including race, religion, color, national origin, disability, gender, gender identity, sexual orientation, age, marital status, veteran status, genetic information, or any other basis prohibited by applicable federal, state, or local laws. Quad also prohibits harassment of applicants and employees based on any of these protected categories.  \n",
        "author": "Alternative_Belt_619",
        "url": "https://www.reddit.com/r/forhire/comments/1eqde49/hiring_data_scientist_i_wi_sussex/",
        "created": "2024-08-12 18:43:17",
        "created_unix": 1723468397.0
    },
    {
        "index": 143,
        "title": "[Hiring] Part-Time Building Maintenance - WI - LOMIRA",
        "body": "Quad Lomira is hiring a Part-Time Building Maintenance Mechanic. This role is responsible for inspecting, troubleshooting, repairing and maintaining the boiler and solvent recovery systems to keep them in safe operating condition at all times.  This includes boilers and their support equipment, solvent recovery from press to the adsorbers, water treatment equipment (boilers and cooling towers), chillers, pumps, air compressors, low pressure air blowers, vacuum pumps, and the fire suppression system.\n\nThe new hire will perform skilled mechanical maintenance work for a variety of systems with the primary responsibility being for boiler and solvent recovery systems.  To contribute to the overall success of the department the operator will need to perform the following duties as well as others that are deemed necessary to maintain the operation.  The position requires the operator to be able to perform the job responsibilities safety, efficiently, in accordance with DNR and EPA guidelines and regulations, and with minimal supervision.\n\n* Boiler operation:  Operate, adjust, shutdown and start-up equipment without supervision.\n* Perform water testing and chemical treatment for boilers and cooling towers.\n* Repair pumps & piping, repack valves and replace seals.\n* Keep equipment logs up to date.\n* Operate, maintain and control plant HPA, LPA and vacuum equipment.\n* Operate, maintain and control solvent recovery systems.\n* Generate reports for the EPA.\n* Operate and control the chilled water for plant chiller operation.\n* Monitor the fire protection system for the facility.\n* Perform daily inspections and maintenance of equipment.\n\n**Qualifications:**\n\n***Education***\n\n* High school diploma or GED\n* Completion of a maintenance program through a technical school is desirable.\n* State license or certification desirable, but not currently required for systems in operation.\n\n***Experience***\n\n* Minimum of 4 years of training to be a Boiler / Solvent Recovery Operator\n* Operation of equipment in boiler room including boilers, de-aerators, pumps, water softeners, reverse osmosis units, water treatment equipment, chillers, cooling towers, air compressors, LPA blowers, and vacuum pumps\n* Operation of equipment in solvent recovery including absorbers, condensers, decanters, exhaust analyzers, fans, cooling towers, water and solvent pumps\n\n***Required Skills***\n\n* Must be able to contribute to team efforts.\n* Must be able to complete a variety of duties, on schedule, while maintaining employer’s standards of safety and cleanliness\n* Must demonstrate good oral, written, reading, and computer skills for effective communication and record keeping.\n* Must have basic welding, soldering and fabrication skills.\n\n***Preferred Skills***\n\n* Should have the ability to effectively troubleshoot and problem solve.\n\n***Physical Requirements***\n\n* Must be able to bend, stoop, reach, and climb ladders up to heights of 20 feet.\n* Must be able to lift, from a standing position, carry, and transport up to 50 pounds regularly and up to 75 pounds on an occasional basis.\n* Must have physical endurance and mobility for prolonged standing, walking, bending and stooping.\n* Must be able to work three 12-hour shifts, days or nights, and holidays, and be able to rotate schedules.\n\nMust be able to work in confined spaces and from lifts or elevated platforms. ",
        "author": "Alternative_Belt_619",
        "url": "https://www.reddit.com/r/forhire/comments/1eqdd3h/hiring_parttime_building_maintenance_wi_lomira/",
        "created": "2024-08-12 18:42:03",
        "created_unix": 1723468323.0
    },
    {
        "index": 144,
        "title": "[Hiring] Maintenance Technician - MO - Kansas City",
        "body": "**Key Contributions:**\n\n~Property Appearance/Upkeep~: Keep the property in a neat, clean, and well-maintained condition. Daily exterior and interior inspections of the community to assure.  Cross utilization of Groundkeeper duties may be required.\n\n~Appliance Maintenance~: Trouble-shoot, diagnose and correct minor failures to air conditioning and heating units. Repair minor electrical and plumbing problems.\n\n~Make Ready~: Responsible for bringing units up to market ready condition in accordance to company standards. Some painting may be required.\n\n~Laundry room~: Maintain laundry rooms to guidelines of the company.\n\n~Pool Maintenance (if applicable)~: Completion of daily chemical inspections, maintenance and cleaning to meet city codes and company standards.\n\n~Customer Service~: Ensure that the property meets and exceeds company standards for resident satisfaction and is available for on-call emergencies (i.e., snow removal) per Community Manager's request.\n\nPerform other duties as needed.\n\n**Essential Mental Alertness Requirements:**\n\n1. Work in a constant state of alertness and safe manner\n2. Ability to perform tasks involving high levels of cognitive function and judgment\n3. Not mentally or physically impaired from any cause that can adversely affect ability to safely and competently perform the duties of the position\n4. Ability to take prompt and appropriate response to operating conditions\n5. Ability to work in an unfatigued state\n6. Ability to accurately gauge lengths of time and distance\n7. Ability to quickly store and recall instructions in one’s short-term memory \n8. Ability to concentrate\n9. Ability to cope with sudden changes in surrounding and/or emergency situations and/or alarms\n10. Demonstrated caring, committed and concerned attitude about safety\n\n**Position Requirements:**\n\n~Education:~ High school diploma or GED required. Pool certification preferred; prefer HVAC certification, boiler certification if appropriate.\n\n~Experience~: One year maintenance experience in residential property experience.\n\n~Physical & Cognitive~: Frequent standing and walking, as well as occasional sitting. Ability to lift, push, pull, and carry up to 110 pounds. Occasional squatting, reaching, stooping, climbing stairs/ladders, and balancing.\n\n~If job includes or may include driving for company business~:\n\n1. Driver must have a valid driver’s license and acceptable motor vehicle record with company insurance carrier\n2. Driver must have reliable means of transportation\n3. Driver must have the ability to be insurable at standard rates for driving.\n4. Driver must provide proof of personal auto liability insurance when using vehicles for company business\n\nTo be hired, candidates will be required to successfully complete a background investigation, drug screen, and a physical demand analysis; when applicable.",
        "author": "Alternative_Belt_619",
        "url": "https://www.reddit.com/r/forhire/comments/1eqd8pn/hiring_maintenance_technician_mo_kansas_city/",
        "created": "2024-08-12 18:36:39",
        "created_unix": 1723467999.0
    },
    {
        "index": 145,
        "title": "[Hiring] Supervisor, Freight Operations - IL - Texico",
        "body": "Minimum qualifications:\n\n* 2 years of related work experience in a warehouse, distribution, supply chain, transportation or similar environment\n* Knowledge of the Less-than-Truckload (LTL) industry, hazardous materials regulations and DOT rules and regulations\n* Available to work a variety of shifts, including days, evenings, nights and weekends\n\n \n\nPreferred qualifications:\n\n* Bachelor’s degree in Transportation, Distribution or Logistics, or 4 years of related work or military experience\n* 2 years of supervisory experience\n* LTL industry experience\n* Positive attitude with the ability to multitask and motivate your team\n* Exceptional leadership, communication and administrative skills\n\n \n\n**About the Freight Operations Supervisor job**\n\nPay, benefits and more:\n\n* Competitive compensation package\n* Full health insurance benefits available on day one\n* Life and disability insurance\n* Earn up to [15 days]() of PTO over your first year\n* 10 paid company holidays\n* 401(k) option with company match\n* Education assistance\n* Opportunity to participate in a company incentive plan\n\n \n\nWhat you’ll do on a typical day:\n\n* Lead and supervise all aspects of freight operations, including inbound/outbound processing, loading, unloading and processing of customer shipments.\n* Develop and implement strategic work procedures to meet the evolving demands of the department.\n* Evaluate and assign driver routes\n* Manage, assign and supervise pickups and deliveries in the local area\n* Supervise hourly staff during various inbound, city and/or outbound freight operations and act as primary point of contact for workplace concerns and questions\n* Ensure production goals are met by managing tonnage, payroll and other administrative functions\n* Plan hourly employee schedules to meet daily operations goals and lower costs\n* Enforce all company, FMCSR, OSHA, CCMTA, NSC and DOT policies, rules, regulations and laws\n* Implement all applicable XPO workplace policies and procedures and enforce compliance with same\n* Ensure customer freight is delivered and picked up timely and damage free.\n* Coach, train and develop employees on proper loading/unloading techniques and productivity, safety, efficiency and quality requirements, including conducting new hire employee evaluations and determining whether to issue, and preparing, corrective action for violations of XPO’s attendance, safety, accountability in the workplace and other workplace policies\n* Effectively direct a team to consistently meet or exceed productivity goals\n* Make recommendations regarding hiring, suspension and firing\n* Develop and present action plans to improve load average and model compliance\n* Participate in internal safety committees and engagement committees\n* Train employees on safety rules and processes\n* Monitor and maintain housekeeping within the shift to ensure safety and productivity\n* Conduct daily staff meetings and communicate corporate messages and revisions to policies and procedures to all team members\n* Inspect working conditions of tools and equipment needed for safe operation within the area and directs the correction of any improper or adverse condition that exists\n* Provide instruction, analyses, suggestions and ideas for improvement of operations within the shift and the service center\n* Act as a champion of our values, demonstrating them and holding your team to the same high standards\n\n \n\nFreight Operations Supervisors are required to:\n\n* Lift objects of various shapes, sizes and weights frequently up to 50 lbs. and occasionally greater than 75 lbs.\n* Reach (including above your head), bend, climb, push, pull, twist, squat and kneel\n* Walk and stand for extended periods on a loading dock that is not climate-controlled and may be slippery\n* Work outside in inclement weather",
        "author": "Alternative_Belt_619",
        "url": "https://www.reddit.com/r/forhire/comments/1eqd7u4/hiring_supervisor_freight_operations_il_texico/",
        "created": "2024-08-12 18:35:34",
        "created_unix": 1723467934.0
    },
    {
        "index": 148,
        "title": "[hiring] Voice Actor",
        "body": "Hey, we are a channel based on Top 10 videos and we are looking for an experienced voice actor. There will be plenty of work and the budget is 15$ per voice over dm me your samples!",
        "author": "Physical-Foot-9683",
        "url": "https://www.reddit.com/r/forhire/comments/1eqcrmd/hiring_voice_actor/",
        "created": "2024-08-12 18:15:45",
        "created_unix": 1723466745.0
    },
    {
        "index": 153,
        "title": "[Hiring] REALTOR® in Niagara Falls, Ontario",
        "body": "# [Seeking REALTOR® in Niagara Falls, Ontario](https://greenhedge.realestate/licensed-realtor-niagara-falls-job-posting.html)\n\nBoutique Real Estate Brokerage with an overabundance of leads is looking for an individual licensed as Broker or Salesperson to be it's newest client representative.\n\nOur small office is currently providing representation services to clients in the Greater Toronto Area, and we are looking for someone to help us expand our coverage.\n\nThis is an excellent opportunity for a motivated individual to bypass the traditional entry-level duties of joining a new brokerage, and immediately assume a prominent role. The successful candidate would have their own dedicated area of operation from the start, where they are the primary point of contact and lead agent, enabling them to focus on high-level tasks such as negotiating deals and managing client relationships without the typical initial period of performing ancillary tasks for established agents.\n\nIf you are based in or around Niagara Falls and want to work full-time as a REALTOR® without the frustrating experience of having to build up a business from the ground up, then consider our Brokerage. There is an excellent chance you will have your own clients shortly after joining us, and that you'll be very busy through the rest of the year without having to worry about personal lead generation.\n\n# Job Description\n\nThe ideal candidate would work full-time as an independent contractor earning a commission-based income. He or she would work directly with clients, guiding them through the process of buying and selling their homes while adhering to rules and regulations governing real estate trading. This includes, but may not be limited to, meeting clients in person, evaluating or showing a home, drafting documents for signature, preparing and launching listings on MLS®, hosting open houses, and responding to inquiries from consumers and other licensees.\n\n# About Green Hedge Realty Inc., Brokerage\n\nGreen Hedge Realty is a full-service Real Estate Brokerage offering traditional MLS® REALTOR® services at non-traditional commission rates. Its low rates allow agents to sign up more clients, do more deals, and earn more money on an annual basis than most traditional agents. Green Hedge Realty distinguishes itself from other low commission Brokerages with its discreet branding, giving its agents the ability to work with more high-end clients than might otherwise be possible.\n\n# Job Requirements\n\n* RECO licence in good standing\n* An interest in working full-time as a REALTOR®\n* Member of (or willing to join) TRREB and able to travel freely within its jurisdiction\n* Resides in and is able to service clients in and around Niagara Falls, Ontario\n* A driver's licence and a reliable vehicle\n* An Internet connected mobile phone\n* A computer or laptop with Internet access\n\n# Ideal Candidate Qualities\n\nIn addition to must-have requirements, the ideal candidate is someone who is self-motivated, organised, punctual, multilingual, knows how to solve problems, is attentive to detail, and has good communication skills as well as good travel flexibility.\n\n# Job Location\n\nFrom home & on the road, in and around Niagara Falls, Ontario.\n\n# Benefits / Potential Earnings\n\nThe Brokerage's business model allows its agents to meet and provide services to more clients than might be possible at a traditional Brokerage, allowing them to earn a higher annual income than most traditional agents. Furthermore, agents at the Brokerage benefit from significantly more autonomy than those at larger firms. This environment enables them to personalize their approach to directly address client needs and shape their business to match their unique style, further enhancing their potential for success. The Brokerage does not charge any agent fees other than a deal fee whenever a commission is earned. Potential earnings are $100,000 - $300,000 annually.\n\n# Job Types\n\nFull-time, Permanent\n\n# Income\n\n$100,000.00-$300,000.00 per year\n\nFor more information and to apply, visit the [Green Hedge Realty Inc., Brokerage Niagara Falls REALTOR Job Posting](https://greenhedge.realestate/licensed-realtor-niagara-falls-job-posting.html)",
        "author": "GreenHedgeRealty",
        "url": "https://www.reddit.com/r/forhire/comments/1eqajlp/hiring_realtor_in_niagara_falls_ontario/",
        "created": "2024-08-12 16:20:49",
        "created_unix": 1723459849.0
    },
    {
        "index": 156,
        "title": "[HIRING] Mobile app developer",
        "body": "Hi, I'm looking for expert mobile app developer with 3+ years of experience. I have multiple project right now so need one person to collaborate with me.  ",
        "author": "Amazing_star3",
        "url": "https://www.reddit.com/r/forhire/comments/1eq966h/hiring_mobile_app_developer/",
        "created": "2024-08-12 14:53:05",
        "created_unix": 1723454585.0
    },
    {
        "index": 162,
        "title": "[HIRING] LOOKING FOR A VIDEO EDITOR",
        "body": "- $60-$120 per project  \n- Roblox niche  \n- For a 445K subscriber YouTube channel  \n  \nMessage (DM) us \"VARIETY,\" and we'll reply with the details.",
        "author": "Alternative-Owl2558",
        "url": "https://www.reddit.com/r/forhire/comments/1epxql2/hiring_looking_for_a_video_editor/",
        "created": "2024-08-12 04:13:50",
        "created_unix": 1723416230.0
    },
    {
        "index": 163,
        "title": "[Hiring] Scrape Reviews in Google Maps using JS and insert to DB",
        "body": "Hi, I'm looking for someone who could write a clear code JS script that would look for reviews in a place on google maps (link would be the only input) and deliver the data in a structured form to a PostgreSQL DB using Drizzle ORM. I'd pay $25/hr, don't think it should take a long time. Thanks",
        "author": "ocap02",
        "url": "https://www.reddit.com/r/forhire/comments/1epw7dp/hiring_scrape_reviews_in_google_maps_using_js_and/",
        "created": "2024-08-12 03:06:53",
        "created_unix": 1723412213.0
    },
    {
        "index": 166,
        "title": "[Hiring] C# - Atas Expert 50$",
        "body": "You must have experience working with Atas\n\n- I want to add a breakeven option to the existing multi SL and TP feature on ATAS trading platform, with the same UI layout.\n- The breakeven option will allow to set a percentage level (e.g., 1%) where the stop loss will be moved to break even.\n- I want the ability to update the breakeven level and offset as the trade progresses.\n- Specifically, I want to be able to add new breakeven levels and offsets to an existing trade without closing and reopening the trade.\n\nFor example, I open a trade with an initial breakeven level of 1% and offset of 0.1%. When the price reaches this level, I want to add another breakeven level of 2% with an offset of 0.15%, without closing the original trade.\n\nAll the original features, indicators, charts, data feeds, etc. will remain unchanged. You will only be adding the new breakeven option to the existing multi SL and TP feature.",
        "author": "Total-Emu-7587",
        "url": "https://www.reddit.com/r/forhire/comments/1epuly0/hiring_c_atas_expert_50/",
        "created": "2024-08-12 01:58:43",
        "created_unix": 1723408123.0
    },
    {
        "index": 179,
        "title": "[hiring] USA and Argentina looking for Participants in a Simple Outlier Project - $60 Incentive!",
        "body": "\n\nHey everyone,\n\nI'm working on a project and need participants from the USA and Argentina. It’s a straightforward task and should only take a short amount of time. To thank you for your help, I'll be offering a $60 incentive.\n\nIf you're interested, please upvote this post and send me a direct message for more details.\n\nThanks!",
        "author": "Conscious_Nobody_744",
        "url": "https://www.reddit.com/r/forhire/comments/1epgmcx/hiring_usa_and_argentina_looking_for_participants/",
        "created": "2024-08-11 14:45:32",
        "created_unix": 1723367732.0
    },
    {
        "index": 183,
        "title": "[Hiring] Verify KYC",
        "body": "Need someone to verify kyc for revoult so I can use it for its Virtual Credit Card. Will pay 10€ in crypto!",
        "author": "Secure_End_3678",
        "url": "https://www.reddit.com/r/forhire/comments/1eped9e/hiring_verify_kyc/",
        "created": "2024-08-11 12:15:28",
        "created_unix": 1723358728.0
    },
    {
        "index": 184,
        "title": "[Hiring] Create a script that can capture eBay seller insights data at scale $200",
        "body": "Hello, I am looking to get terrapeak eBay seller insights data at scale but continue to run into a 250 limit call each day. Looking for someone who can put together a proof of concept which can handle 500k requests per day. Thanks.",
        "author": "shipchain_jacob",
        "url": "https://www.reddit.com/r/forhire/comments/1ep9af8/hiring_create_a_script_that_can_capture_ebay/",
        "created": "2024-08-11 07:22:49",
        "created_unix": 1723341169.0
    },
    {
        "index": 186,
        "title": "[HIRING] League of Legends Short-form  Video Editor",
        "body": "Hello r/forhire!\n\nWe're looking for a part-time video editor who is knowledgeable about and current with League of Legends. The starting rate is $15 per hour, with the potential for full-time opportunities down the line.",
        "author": "InternationalEar728",
        "url": "https://www.reddit.com/r/forhire/comments/1ep5pjl/hiring_league_of_legends_shortform_video_editor/",
        "created": "2024-08-11 04:24:10",
        "created_unix": 1723330450.0
    },
    {
        "index": 187,
        "title": "[Hiring] A webtoon designer or drawer",
        "body": "Hi!! I am looking for a webtoon artist to draw oht a couple scenes for my story! budget is about 50$ PER SCENE but super negotiable depending on ur talent!! please let me know!! ",
        "author": "Sunnysunnybb16",
        "url": "https://www.reddit.com/r/forhire/comments/1ep5p58/hiring_a_webtoon_designer_or_drawer/",
        "created": "2024-08-11 04:23:37",
        "created_unix": 1723330417.0
    },
    {
        "index": 189,
        "title": "[Hiring] Spreading the word about a cool opportunity",
        "body": "I’ve been working on a really cool project where I have been getting paid to carry out conversations with other participants that range across different role-play and conversation topics, in order to train the next generation of artificial intelligence models.\n\nI wanted to spread the word, as I get a referral bonus if you mention this post. I’ve been having a lot of fun with this, and I hope we can find more people to join the project! \n\nYou will be compensated $5 for each 15 minute call, an effective rate of $20/hr.\n\nWe are looking for:\n    ⁃    You enjoy chatting with new people, are great at role-playing/improvising on the fly, and can voice-act a wide range of emotions.\n    ⁃    You must be based in the United States and call in from a US cell phone number. Voice-over-IP or other call-center numbers are not allowed.\n    ⁃    You must speak fluent, conversational English.\n\nApply here to conduct a 5-minute interview to get started!\n https://docs.google.com/forms/d/e/1FAIpQLSc4IsxOOS9L3Gpb42z_hGhDHUMmMoM85tE-y9LZutSSLdkD_w/viewform?usp=sf_link",
        "author": "Ducklord99",
        "url": "https://www.reddit.com/r/forhire/comments/1ep36xa/hiring_spreading_the_word_about_a_cool_opportunity/",
        "created": "2024-08-11 02:27:40",
        "created_unix": 1723323460.0
    },
    {
        "index": 191,
        "title": "[Hiring] Build a raspberry pi project using cameras and api communication. $35/hr",
        "body": "Hello,\n\nI am looking to develop an idea where multiple cameras will be controlled by a single raspberry pi device. The device will wait for an api call to initiate cameras and would need a way to communicate the photos back to an api once complete.",
        "author": "shipchain_jacob",
        "url": "https://www.reddit.com/r/forhire/comments/1ep2b44/hiring_build_a_raspberry_pi_project_using_cameras/",
        "created": "2024-08-11 01:46:56",
        "created_unix": 1723321016.0
    },
    {
        "index": 198,
        "title": "[HIRING] Automation Bot Expert Booking Appointments",
        "body": "Hello, im looking for some expert in this field to make an automatation browing bot. The bot will grab appointments when available on webiste, and keep trying again and again 24x7.\n\nI have made a video of the website and what it should do (without some technical aspects, because those could only be explained in words, and seen while programming the bot).\n\nThe bot is for spanish website, so there are many provinces, and different appointments for specific need.\n\nFirst of all, the bot is browsing orientated, it has some forms to fill like the data, and the telephone number and emails ( for these two we will discuss later what is the best method to implement those to automate), so you need api integration or form integration knowledge too, if thats how its called, so one dont have to put manually that data in every browser tab, for example [https://app.appsmith.com/](https://app.appsmith.com/) , ive been using this for a guy that already had a bot, and all i did was fill the form and the moment i pressed ok, the bot would automatically start to find appointment with that data, if we can use the same method it would be nice.\n\nThis website works with only spanish proxies, we need to buy best and fast proxies. When you try few times or even 2-3 times, the website detects the automatation and it blocks your ip, so we need the proxies rotation to takle that, avoid websites securities and blockage to have an efficient bot.\n\nI dont know much about it or how it works or how its implemented, but ive been working with a guy that had a bot, and all i did was fill that form, with all the data that this website requires when u try it manually, the document number, name, year birth, a telephone number and a email, and on the background the bot would start to find the appointment, i knwo this because he had a telegram bot implemented, and if appointment already existen on that document number (only 1 appointment can be existing on 1 document number), telegram bot would send me a message that this name and document number had an appointment already, and otherwise when the bot itself grabs the appointment, it sends me the information of the appointment. (I can show you later the bot and the telegram bot).\n\nThere are many different type of appointments, different provinces cities, so it will have many tabs or searchings at the same time.\n\nI need the best and most quick bot as possible, there is a lot of competition and bots involved, i dont know how this website works, because i need really to talk with someone when they accept the job before accepting the job and telling me their budget.\n\nI dont have problem with the budget, as long as the project is well build and does what i want.\n\nPlease feel free to contact me for any inquiries, somehow, i dont knwo how its possible here.\n\nthis is the website: [https://icp.administracionelectronica.gob.es/icpplus/index.html](https://icp.administracionelectronica.gob.es/icpplus/index.html) (you need spanish vpn to log)\n\n[https://www.transfernow.net/dl/20240810ndneaK52](https://www.transfernow.net/dl/20240810ndneaK52) this is my video interacting and explaning the website.",
        "author": "Think-Atmosphere9937",
        "url": "https://www.reddit.com/r/forhire/comments/1eor990/hiring_automation_bot_expert_booking_appointments/",
        "created": "2024-08-10 17:26:15",
        "created_unix": 1723290975.0
    },
    {
        "index": 201,
        "title": "[Hiring] Looking for a Leads Generator(needs to get numbers)\n",
        "body": "Hey There,\n\nWe are a trading bot company and currently we are expanding in the trading field currently we are looking for a leads generator for our company and the pay is 100$ for each client you suggest which gets closed. Sounds good?\n\nKindly DM me and explain about your experience in this field and your work ,The one with the best ability will get hired.",
        "author": "Only-Note-2544",
        "url": "https://www.reddit.com/r/forhire/comments/1eopylf/hiring_looking_for_a_leads_generatorneeds_to_get/",
        "created": "2024-08-10 16:06:11",
        "created_unix": 1723286171.0
    },
    {
        "index": 202,
        "title": "[HIRING] Website Testers Needed Across Globe!",
        "body": "Are you ready to help improve online experiences? We’re looking for people to test our websites and provide feedback. Earn between €30 to €150 depending on the site’s complexity.\n\n**Who Can Apply?**\n\n* Residents of Germany, Australia, Austria, Belgium, Bulgaria, Cyprus, Croatia, Denmark, Spain, Estonia, United States, Finland, France, Greece, Hungary, Ireland, Iceland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Norway, Netherlands, Poland, Portugal, Czech Republic, Romania, United Kingdom, Singapore, Slovakia, Slovenia, Sweden, Switzerland\n\n* No expertise is needed—ordinary users are perfect!\n\n**What to Do:**\n\n1. **Screen record your experience on our websites:** As you navigate our websites, screen record your experience to help us identify any bugs or issues.\n\n1. **Provide Feedback:** Send the video and feedback via WhatsApp.\n\n1. **Stay Honest**: We value your honest opinions on what you like, dislike, and your suggestions for improvement.\n\n**Important:**\n\n* **No VPNs:** Please do not use VPNs or similar tools, as our websites have detection systems for these practices.\n\n* iPhone users preferred.\n\nInterested? Contact us via WhatsApp. +48 692 887 209 for more details. We will review applications and, if selected, you will be added to our list of testers. \n\nJoin us and make the web a better place while earning extra cash. We look forward to working with you! :)",
        "author": "Popular-War-9178",
        "url": "https://www.reddit.com/r/forhire/comments/1eopitz/hiring_website_testers_needed_across_globe/",
        "created": "2024-08-10 15:36:53",
        "created_unix": 1723284413.0
    },
    {
        "index": 203,
        "title": "[HIRING] Website Testers Needed Across Globe!",
        "body": "**Website Testers Needed Across Europe!**\n\nAre you ready to help improve online experiences? We’re looking for people to test our websites and provide feedback. Earn between €30 to €150 depending on the site’s complexity.\n\n**Who Can Apply?**\n\n* Residents of Germany, Australia, Austria, Belgium, Bulgaria, Cyprus, Croatia, Denmark, Spain,  Estonia, United States, Finland, France, Greece, Hungary, Ireland, Icelan,  Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Norway, Netherlands, Poland, Portugal, Czech Republic, Romania, United Kingdom, Singapore, Slovakia, Slovenia, Sweden, Switzerland\n* No expertise is needed—ordinary users are perfect!\n\n**What to Do:**\n\n1. **Screen record your experience on our websites:** As you navigate our websites, screen record your experience to help us identify any bugs or issues.\n2. **Provide Feedback:** Send the video and feedback via WhatsApp.\n3. **Stay Honest**: We value your honest opinions on what you like, dislike, and your suggestions for improvement.\n\n**Important:**\n\n* **No VPNs:** Please do not use VPNs or similar tools, as our websites have detection systems for these practices.\n* iPhone users preferred.\n\nInterested? Contact us via WhatsApp. +48 692 887 209 for more details. We will review applications and, if selected, you will be added to our list of testers. \n\nJoin us and make the web a better place while earning extra cash. We look forward to working with you! :)",
        "author": "Popular-War-9178",
        "url": "https://www.reddit.com/r/forhire/comments/1eoou4z/hiring_website_testers_needed_across_globe/",
        "created": "2024-08-10 14:49:29",
        "created_unix": 1723281569.0
    },
    {
        "index": 207,
        "title": "[HIRING] Minecraft Photon Mod $60",
        "body": "I need someone who can modify my existing mod to FabricMC version 1.21",
        "author": "Feisty-Big9913",
        "url": "https://www.reddit.com/r/forhire/comments/1eoluu3/hiring_minecraft_photon_mod_60/",
        "created": "2024-08-10 11:28:58",
        "created_unix": 1723269538.0
    },
    {
        "index": 210,
        "title": "[Hiring] OneText (YC W23) is hiring a lead TypeScript/Node engineer",
        "body": "We're two former leads from the PayPal Checkout team (engineering & product), did Y Combinator in 2023 and closed our seed funding round for our startup OneText. We're looking for a lead TypeScript/Node engineer to join us!\n\nOur goal is simple: to make it possible to use your phone number to pay anywhere and everywhere, with zero friction. We have a ton of cool ways to make that work, and hundreds of merchants and brands already using our platform.\n\nApply at: https://gist.github.com/bluepnume/8f2376b0893bc6b85564e7359359ecd4",
        "author": "Chun",
        "url": "https://www.reddit.com/r/forhire/comments/1eogqoe/hiring_onetext_yc_w23_is_hiring_a_lead/",
        "created": "2024-08-10 06:49:28",
        "created_unix": 1723252768.0
    },
    {
        "index": 213,
        "title": "[Hiring] (Phoenix, AZ) Seeking a Field Service Technician ",
        "body": "**ESSENTIAL DETAILS:**\n\n·       Relocation Assistance Available\n\n·       $2,000 Sign On Bonus\n\n·       Must have experience with Pumps, Motors, VFDs, Plumbing, Mechanical and Electrical Systems, Piping, High Pressure Components, Industrial Controls, PLC Systems, etc.\n\n·       Excellent Driving Record\n\n·       Willing to submit to a stringent background screening (Federal Contractor)\n\n·       Have high integrity and take pride in your work\n\n·       Pay is DOE, 24-32/hr + Bonus opportunities\n\n You will have the opportunity to assist with the overall growth and development of a small business and work for a rewarding employer with an outstanding team of professionals to troubleshoot new challenges daily, complete projects, provide excellent customer service and solutions to all our unique customers.\n\n**ESSENTIAL FUNCTIONS:**\n\n·       Major areas of responsibility will be installation, start-up, inspection, preventative maintenance, troubleshooting, repairs, and emergency service of industrial process equipment. (Pumps, Motors, VFDs, Plumbing, Mechanical and Electrical Systems, Piping, High Pressure Components, Industrial Controls, PLC Systems, etc)\n\n·       Assembly and installation of new equipment and systems at customer sites\n\n·       This position requires extensive travel, a solid knowledge of mechanical, electrical, hydraulics, pneumatic, electronics and experience in troubleshooting such systems\n\n·       You will represent and promote the company; its products and services, as well as pro-actively seek and pursue new prospects/projects, with existing and prospective customers, in order to increase profitable sales\n\n·       Build relationships with our valued customers and keep their needs at the forefront at all times\n\n**QUALIFICATIONS:**\n\n·       Strong customer orientation – Dependable, hands-on, hardworking, honest and ability to work effectively under pressure\n\n·       Understanding of the importance of being a team player to achieve organizational goals\n\n·       Self-motivated, self-starter, results driven, sense of urgency, personable, extroverted personality, well organized and dependable\n\n·       Strong Knowledge and background in mechanical, plumbing, electrical and electronic systems\n\n·       Familiar with mechanical and electrical equipment\n\n·       Experience with bending and installation of rigid, IMC and EMT conduits\n\n·       Ability to perform load calculations for circuits and calculate working circuit ampacities to determine proper conductor size\n\n·       3 Phase WYE and Delta experience, and electrical panel building\n\n·       Knowledge of PLC systems operation\n\n·       Able to understand mechanical, electrical, and electronic/computer hardware functionality and use knowledge to troubleshoot equipment.\n\n·       Fluent in English with excellent communication and listening skills\n\n·       High school or equivalent - required, Associate's degree or Bachelor's degree preferred\n\n·       2 years minimum of experience in field or related area, 5 plus years preferred\n\n**·       Must be willing to travel Extensively - usually 100% travel Monday - Friday.**\n\n·       Driver’s license and excellent driving record required.\n\n·       Ability to pass stringent background screening and obtain military base clearances.",
        "author": "Ill-Grass-1325",
        "url": "https://www.reddit.com/r/forhire/comments/1eoc41b/hiring_phoenix_az_seeking_a_field_service/",
        "created": "2024-08-10 03:21:10",
        "created_unix": 1723240270.0
    },
    {
        "index": 220,
        "title": "[Hiring] Complete my webull referral and ill pay you $21",
        "body": "Use this link to download webull and deposit as low as 5 cents and I’ll pay you $25 for your time and help. *Must be located in US for app to work*\n\nLink:\n\nhttps://a.webull.com/NwcDGzCumCmnkqI6uc\n\nSend screenshot proof of your initial deposit\n\nI need 8 people! \n",
        "author": "AutomaticAgency6525",
        "url": "https://www.reddit.com/r/forhire/comments/1eo8qwu/hiring_complete_my_webull_referral_and_ill_pay/",
        "created": "2024-08-10 01:02:51",
        "created_unix": 1723231971.0
    },
    {
        "index": 221,
        "title": "[HIRING] Web Designer - Manila (On-Site) \n",
        "body": "Salary: PHP 20,000 - PHP 30,000\n\nYears of experience and skills needed:\n\n* Designing and maintaining Webpages\n* Creating wireframe, prototypes, mockups for web platform.\n* Creating & providing all Brand collaterals, maintain UI & Design System.\n* Determining technical requirements\n* Knowledge on Web Front-End: HTML5 / CSS3 / JavaScript\n* Open for Filipino Citizens only \n\nIf you think you fit the qualifications, let me know so I can give you my email. Thanks! ",
        "author": "Free_Fly_7389",
        "url": "https://www.reddit.com/r/forhire/comments/1eo8b7q/hiring_web_designer_manila_onsite/",
        "created": "2024-08-10 00:45:06",
        "created_unix": 1723230906.0
    },
    {
        "index": 222,
        "title": "[HIRING] DJ logo | online radio graphics/logo | video editing",
        "body": "Hi there. I'm a dj/music producer who is going to start an online radio station soon. My logo is very outdated, so I need a new one for myself, a logo/graphic for the (online) radio station, and separately (likely) someone who can do video graphics/editing to the live stream DJ videos (cool effects, things to make it unique and interesting, etc.). \n\nI realize likely the designer for the logos and the video editing will be different skillsets.\n\nPlease submit your portfolios to me. I don't know the current rates, but I want good quality work. Willing to pay $50-75/hr, or more, depending on quality of work and experience. \n\nIdeally I'd like to hire someone I can use as often as weekly once the radio station starts, as I will need new graphics (probably) for each episode.",
        "author": "Runaway_5",
        "url": "https://www.reddit.com/r/forhire/comments/1eo8548/hiring_dj_logo_online_radio_graphicslogo_video/",
        "created": "2024-08-10 00:38:00",
        "created_unix": 1723230480.0
    },
    {
        "index": 223,
        "title": "[HIRING] Product Operation Executive - Manila (On-site)\n",
        "body": "Salary: PHP 20,000 - PHP 30,000\n\n  \nYears of experience and skills needed:\n\n* Comprehend project initiatives and requirements to craft comprehensive business requirements.\n* Collaborate on testing procedures to ensure the timely delivery of error-free project scopes.\n* Provide adept support for all external inquiries from product providers and internal queries from departments including CS, Marketing, Product Marketing, and risk management.\n* Investigate inquiries thoroughly, delivering optimal solutions and responses to users.\n* Identify and investigate incidents, furnishing findings and provide the solutions to Team lead.\n* Open to Filipino Citizen only\n\nIf you think you fit the qualifications, let me know so I can give you my email. Thanks! \n\n\n\n",
        "author": "Free_Fly_7389",
        "url": "https://www.reddit.com/r/forhire/comments/1eo7zxa/hiring_product_operation_executive_manila_onsite/",
        "created": "2024-08-10 00:32:09",
        "created_unix": 1723230129.0
    },
    {
        "index": 224,
        "title": "[Hiring] Data Quality Tester- 8 to 16 lpa",
        "body": "Job title: Data Quality Tester Location: Fully Remote / India\n\n• Need at least 7 + Years of Experience • Must have E-commerce Experience• Knowledge and experience working with C#, Python, SQL• Needs to have experience and understand the specifics of E-commerce data flows• Develop and maintain detailed test plans to ensure stability and accuracy of relations databases and scheduled cron jobs in e-commerce and middleware systems • Proficient in requirement analysis, defect tracking, coordinating with the team members across various locations, and handling test reporting and Signoffs.• Eliminate data errors or duplicate entries and ensure optimal data integration by consolidating data from various sources into a centralized data warehouse.\n\nPLEASE SHARE YOUR RESUMES....Email: [alex@innoverglobalinc.com](mailto:alex@innoverglobalinc.com) [m.a.nouman786@gmail.com](mailto:m.a.nouman786@gmail.com)",
        "author": "Front_Succotash_417",
        "url": "https://www.reddit.com/r/forhire/comments/1eo6fqh/hiring_data_quality_tester_8_to_16_lpa/",
        "created": "2024-08-09 23:28:53",
        "created_unix": 1723226333.0
    }
]